[Killed] ArrowFunction
src/services/API.js:92:35
     getUsageByUser = async (year, month, filter) => {
         const result = await this.data();
         const days = DateTime.local(year, month).daysInMonth;
-        let usage = result.filter((element) => element.year === year && element.month === month);
+        let usage = result.filter(() => undefined);
         if (filter) {
             usage = usage.filter((entry) => {
killedBy: UseUsageByUser should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "average": 2910960.6,
+   "average": 0,
