[Killed] BlockStatement
src/App.jsx:40:82
 const appVersion = import.meta.env.VITE_VERSION;
 const appTime = DateTime.local().toLocaleString(DateTime.DATETIME_FULL_WITH_SECONDS);
 
-const App = ({ name = appName, version = appVersion, currentTime = appTime }) => {
-    return (
-        <HashRouter>
-            <ThemeProvider theme={theme}>
-                <CssBaseline />
-                <Header name={name} version={version} />
-                <Navigation menu={menu} />
-                <ErrorBoundary onError={ErrorDisplay}>
-                    <BWMonRoutes menu={menu} />
-                    <Footer currentTime={currentTime} />
-                </ErrorBoundary>
-            </ThemeProvider>
-        </HashRouter>
-    );
-};
+const App = ({ name = appName, version = appVersion, currentTime = appTime }) => {};
 
 App.propTypes = { name: PropTypes.string, version: PropTypes.string, currentTime: PropTypes.string };
killedBy: App renders the landing page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="app-title"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
