[Killed] BlockStatement
src/components/graph/Graph.jsx:25:40
 // scan-suspicious-ignore-next-line
 const Chart = React.lazy(() => import('react-apexcharts'));
 
-const Graph = ({ options, series }) => {
-    return (
-        <Suspense fallback={<div>Loading...</div>}>
-            <Chart options={options} series={series} type="bar" height={500} />
-        </Suspense>
-    );
-};
+const Graph = ({ options, series }) => {};
 
 Graph.propTypes = { options: PropTypes.object.isRequired, series: PropTypes.array.isRequired };
killedBy: Graph renders chart with provided options and series
statusReason: Error: Unable to find an element by: [data-testid="apex-chart"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
