[Killed] BlockStatement
src/components/inputs/DropDown.jsx:23:43
 import PropTypes from 'prop-types';
 import { Select, MenuItem } from '@mui/material';
 
-const DropDown = ({ items, ...props }) => {
-    return items && props.value ? (
-        <Select {...props}>
-            {items.map((item, index) => (
-                <MenuItem key={index} value={item}>
-                    {item}
-                </MenuItem>
-            ))}
-        </Select>
-    ) : null;
-};
+const DropDown = ({ items, ...props }) => {};
 
 DropDown.propTypes = { items: PropTypes.array, value: PropTypes.any };
killedBy: UsageByUser renders year selector
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="user-year"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-1gtchvp-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] ConditionalExpression
src/components/inputs/DropDown.jsx:24:12
 import { Select, MenuItem } from '@mui/material';
 
 const DropDown = ({ items, ...props }) => {
-    return items && props.value ? (
+    return true ? (
         <Select {...props}>
             {items.map((item, index) => (
killedBy: App renders the landing page
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
src/components/inputs/DropDown.jsx:24:12
 import { Select, MenuItem } from '@mui/material';
 
 const DropDown = ({ items, ...props }) => {
-    return items && props.value ? (
+    return false ? (
         <Select {...props}>
             {items.map((item, index) => (
killedBy: UsageByUser renders year selector
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="user-year"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-1gtchvp-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] ArrowFunction
src/components/inputs/DropDown.jsx:26:24
 const DropDown = ({ items, ...props }) => {
     return items && props.value ? (
         <Select {...props}>
-            {items.map((item, index) => (
-                <MenuItem key={index} value={item}>
-                    {item}
-                </MenuItem>
-            ))}
+            {items.map(() => undefined)}
         </Select>
     ) : null;
killedBy: UsageByUser renders year selector
statusReason: TestingLibraryElementError: Unable to find an element with the text: 2021. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<div
  class="MuiInputBase-root MuiOutlinedInput-root MuiInputBase-colorPrimary MuiSelect-root css-sc8y68-MuiInputBase-r
