[Killed] BlockStatement
src/components/loading/Loading.jsx:26:36
 
 const options = { width: '100%', mt: 2 };
 
-const Loading = ({ isLoading }) => {
-    return isLoading ? (
-        <Box sx={options}>
-            <LinearProgress />
-            <InfoMessage message="Loading..." />
-        </Box>
-    ) : null;
-};
+const Loading = ({ isLoading }) => {};
 
 Loading.propTypes = { isLoading: PropTypes.bool.isRequired };
killedBy: UsageByUser renders loading state
statusReason: TestingLibraryElementError: Unable to find an element with the text: Loading.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-1gt
