[Killed] BlockStatement
src/components/main/ErrorDisplay.jsx:23:43
 import ErrorMessage from '../messages/ErrorMessage';
 import PropTypes from 'prop-types';
 
-const ErrorDisplay = ({ error, info }) => {
-    return (
-        <div>
-            <ErrorMessage message={error.toString()} />
-            <div>{info.componentStack}</div>
-        </div>
-    );
-};
+const ErrorDisplay = ({ error, info }) => {};
 
 ErrorDisplay.propTypes = { error: PropTypes.object.isRequired, info: PropTypes.object.isRequired };
killedBy: ErrorDisplay renders error message and component stack
statusReason: TestingLibraryElementError: Unable to find an element with the text: Error: --- Error ---. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
