[Killed] BlockStatement
src/components/main/Footer.jsx:25:37
 
 const options = { flexGrow: 1, m: 2 };
 
-const Footer = ({ currentTime }) => {
-    return (
-        <Box sx={options}>
-            <Typography data-testid="app-footer1" id="app-footer1" variant="subtitle2">
-                All usage information is in gigabytes
-            </Typography>
-            <Typography data-testid="app-footer2" id="app-footer2" variant="subtitle2">
-                This page was generated on {currentTime}
-            </Typography>
-        </Box>
-    );
-};
+const Footer = ({ currentTime }) => {};
 
 Footer.propTypes = { currentTime: PropTypes.string.isRequired };
killedBy: App renders the landing page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="app-footer2"]

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      class="MuiPaper-root MuiPaper-elevation MuiPaper-elevation4 MuiAppBar-root MuiAppBar-colorPrimary MuiAppBar-positionStatic css-ptdwpq-MuiPaper-root-MuiAppBar-root"
      style="--Paper-shadow: 0px 2px 4px -1px rgba(0,0,0,0.2),0px 4px 5px 0px
