[Killed] BlockStatement
src/components/main/Header.jsx:25:39
 
 const options = { flexGrow: 1 };
 
-const Header = ({ name, version }) => {
-    return (
-        <AppBar position="static">
-            <Toolbar variant="dense">
-                <Typography data-testid="app-title" id="app-title" variant="h6" sx={options}>
-                    {name}
-                </Typography>
-                <Typography data-testid="app-version" id="app-version">
-                    {version}
-                </Typography>
-            </Toolbar>
-        </AppBar>
-    );
-};
+const Header = ({ name, version }) => {};
 
 Header.propTypes = { name: PropTypes.string.isRequired, version: PropTypes.string };
killedBy: App renders the landing page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="app-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiBottomNavigation-root css-1cyizfr-MuiBottomNavigation-root"
    >
