[Killed] BlockStatement
src/components/messages/ErrorMessage.jsx:23:39
 import PropTypes from 'prop-types';
 import Message from './Message';
 
-const ErrorMessage = ({ message }) => {
-    return <Message severity="error" message={message} />;
-};
+const ErrorMessage = ({ message }) => {};
 
 ErrorMessage.propTypes = { message: PropTypes.string };
killedBy: ErrorMessage renders the message with the correct severity
statusReason: TestingLibraryElementError: Unable to find an element with the text: error message text. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
