[Killed] BlockStatement
src/components/messages/InfoMessage.jsx:23:38
 import PropTypes from 'prop-types';
 import Message from './Message';
 
-const InfoMessage = ({ message }) => {
-    return <Message severity="info" message={message} />;
-};
+const InfoMessage = ({ message }) => {};
 
 InfoMessage.propTypes = { message: PropTypes.string };
killedBy: UsageByUser renders loading state
statusReason: TestingLibraryElementError: Unable to find an element with the text: Loading.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-1gt
