[Killed] BlockStatement
src/components/messages/Message.jsx:25:44
 
 const options = { width: '100%', mb: 2 };
 
-const Message = ({ severity, message }) => {
-    return message ? (
-        <Box sx={options}>
-            <Alert severity={severity}>
-                <AlertTitle>{message}</AlertTitle>
-            </Alert>
-        </Box>
-    ) : null;
-};
+const Message = ({ severity, message }) => {};
 
 Message.propTypes = { severity: PropTypes.string.isRequired, message: PropTypes.string };
killedBy: UsageByUser renders loading state
statusReason: TestingLibraryElementError: Unable to find an element with the text: Loading.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-1gt
