[Killed] BlockStatement
src/components/navigation/BWMonRoutes.jsx:24:35
 import { Route, Routes } from 'react-router';
 import PageNotFound from './PageNotFound';
 
-const BWMonRoutes = ({ menu }) => {
-    return (
-        <Routes>
-            <Route key="0-default" path="/" element={menu[0].element} />
-            {menu.map((route, _index) => (
-                <Route key={route.pathname} path={route.pathname} element={route.element} />
-            ))}
-            <Route key="0-error" Component={<PageNotFound />} />
-        </Routes>
-    );
-};
+const BWMonRoutes = ({ menu }) => {};
 
 BWMonRoutes.propTypes = {
killedBy: App renders the landing page
statusReason: Error: The element(s) given to waitForElementToBeRemoved are already removed. waitForElementToBeRemoved requires that the element(s) exist(s) before waiting for removal.

[Killed] ArrowFunction
src/components/navigation/BWMonRoutes.jsx:28:23
     return (
         <Routes>
             <Route key="0-default" path="/" element={menu[0].element} />
-            {menu.map((route, _index) => (
-                <Route key={route.pathname} path={route.pathname} element={route.element} />
-            ))}
+            {menu.map(() => undefined)}
             <Route key="0-error" Component={<PageNotFound />} />
         </Routes>
killedBy: BWMonRoutes renders specific route
statusReason: TestingLibraryElementError: Unable to find an element with the text: Page 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
