[Killed] BlockStatement
src/components/navigation/Navigation.jsx:27:34
 
 const options = { width: '100%' };
 
-const Navigation = ({ menu }) => {
-    const { index, setIndex } = useNavigation(menu);
-
-    const handleChange = (event, newRouteIndex) => setIndex(newRouteIndex);
-
-    return (
-        <BottomNavigation value={index} onChange={handleChange} showLabels sx={options}>
-            {menu.map((route, index) => (
-                <BottomNavigationAction
-                    data-testid={route.id}
-                    id={route.id}
-                    key={route.pathname}
-                    value={index}
-                    label={route.label}
-                    icon={route.icon}
-                    component={Link}
-                    to={route.pathname}
-                />
-            ))}
-        </BottomNavigation>
-    );
-};
+const Navigation = ({ menu }) => {};
 
 Navigation.propTypes = {
killedBy: App renders the landing page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="usage-by-user"]

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      class="MuiPaper-root MuiPaper-elevation MuiPaper-elevation4 MuiAppBar-root MuiAppBar-colorPrimary MuiAppBar-positionStatic css-ptdwpq-MuiPaper-root-MuiAppBar-root"
      style="--Paper-shadow: 0px 2px 4px -1px rgba(0,0,0,0.2),0px 4px 5px 0

[Killed] ArrowFunction
src/components/navigation/Navigation.jsx:30:26
 const Navigation = ({ menu }) => {
     const { index, setIndex } = useNavigation(menu);
 
-    const handleChange = (event, newRouteIndex) => setIndex(newRouteIndex);
+    const handleChange = () => undefined;
 
     return (
killedBy: Navigation calls setIndex with the new route index when handleChange is triggered
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1

Number of calls: 0

[Killed] ArrowFunction
src/components/navigation/Navigation.jsx:34:23
 
     return (
         <BottomNavigation value={index} onChange={handleChange} showLabels sx={options}>
-            {menu.map((route, index) => (
-                <BottomNavigationAction
-                    data-testid={route.id}
-                    id={route.id}
-                    key={route.pathname}
-                    value={index}
-                    label={route.label}
-                    icon={route.icon}
-                    component={Link}
-                    to={route.pathname}
-                />
-            ))}
+            {menu.map(() => undefined)}
         </BottomNavigation>
     );
killedBy: App renders the landing page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="usage-by-user"]

Ignored nodes: comments, script, style
<body>
  <div>
    <header
      class="MuiPaper-root MuiPaper-elevation MuiPaper-elevation4 MuiAppBar-root MuiAppBar-colorPrimary MuiAppBar-positionStatic css-ptdwpq-MuiPaper-root-MuiAppBar-root"
      style="--Paper-shadow: 0px 2px 4px -1px rgba(0,0,0,0.2),0px 4px 5px 0
