[Killed] ArrowFunction
src/components/table/Body.jsx:25:21
 
 const Body = ({ prefix, cellInfos, values }) => (
     <TableBody>
-        {values.map((value, index) => (
-            <TableRow
-                key={value.id}
-                id={prefix + '-data-' + index}
-                data-testid={prefix + '-data-' + index}
-                style={index % 2 ? { background: 'ghostwhite' } : { background: 'white' }}
-            >
-                {cellInfos.map((cellInfo) => {
-                    return (
-                        <TableCell key={cellInfo.id} align={cellInfo.align}>
-                            {cellInfo.convert ? cellInfo.convert(value[cellInfo.id]) : value[cellInfo.id]}
-                        </TableCell>
-                    );
-                })}
-            </TableRow>
-        ))}
+        {values.map(() => undefined)}
     </TableBody>
 );
killedBy: UsageByUser renders table body row 1
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="user-data-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-1gtchvp-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Survived] StringLiteral
src/components/table/Body.jsx:28:30
         {values.map((value, index) => (
             <TableRow
                 key={value.id}
-                id={prefix + '-data-' + index}
+                id={prefix + "" + index}
                 data-testid={prefix + '-data-' + index}
                 style={index % 2 ? { background: 'ghostwhite' } : { background: 'white' }}

[Killed] ArithmeticOperator
src/components/table/Body.jsx:30:24
                 key={value.id}
                 id={prefix + '-data-' + index}
                 data-testid={prefix + '-data-' + index}
-                style={index % 2 ? { background: 'ghostwhite' } : { background: 'white' }}
+                style={index * 2 ? { background: 'ghostwhite' } : { background: 'white' }}
             >
                 {cellInfos.map((cellInfo) => {
killedBy: Body Component applies alternating row colors
statusReason: Error: expect(element).toHaveStyle()

- Expected
+ Received

- background: white;
+ background: ghostwhite;

[Killed] ObjectLiteral
src/components/table/Body.jsx:30:67
                 key={value.id}
                 id={prefix + '-data-' + index}
                 data-testid={prefix + '-data-' + index}
-                style={index % 2 ? { background: 'ghostwhite' } : { background: 'white' }}
+                style={index % 2 ? { background: 'ghostwhite' } : {}}
             >
                 {cellInfos.map((cellInfo) => {
killedBy: Body Component applies alternating row colors
statusReason: Error: expect(element).toHaveStyle()

- Expected
+ Received

- background: white;

[Killed] BlockStatement
src/components/table/Body.jsx:32:46
                 data-testid={prefix + '-data-' + index}
                 style={index % 2 ? { background: 'ghostwhite' } : { background: 'white' }}
             >
-                {cellInfos.map((cellInfo) => {
-                    return (
-                        <TableCell key={cellInfo.id} align={cellInfo.align}>
-                            {cellInfo.convert ? cellInfo.convert(value[cellInfo.id]) : value[cellInfo.id]}
-                        </TableCell>
-                    );
-                })}
+                {cellInfos.map((cellInfo) => {})}
             </TableRow>
         ))}
killedBy: Body Component renders table rows and cells
statusReason: TestingLibraryElementError: Unable to find an element with the text: John Doe. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table>
      <tbody
        class="MuiTableBody-root css-gmh7jj-MuiTableBody-root"
