[Killed] BlockStatement
src/components/table/Footer.jsx:23:51
 import PropTypes from 'prop-types';
 import { TableHead, TableRow, TableCell } from '@mui/material';
 
-const Footer = ({ prefix, cellInfos, values }) => {
-    const cellText = (index, cellInfo) =>
-        index === 0
-            ? 'Totals'
-            : cellInfo.footer
-              ? cellInfo.convert
-                  ? cellInfo.convert(values[cellInfo.id])
-                  : values[cellInfo.id]
-              : '';
-
-    return (
-        <TableHead>
-            <TableRow key="footer" data-testid={prefix + '-footer'} id={prefix + '-footer'}>
-                {cellInfos.map((cellInfo, index) => {
-                    return (
-                        <TableCell key={cellInfo.id} align={cellInfo.align}>
-                            {cellText(index, cellInfo)}
-                        </TableCell>
-                    );
-                })}
-            </TableRow>
-        </TableHead>
-    );
-};
+const Footer = ({ prefix, cellInfos, values }) => {};
 
 Footer.propTypes = {
killedBy: UsageByUser renders table footer
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="user-footer"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-1gtchvp-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] ArrowFunction
src/components/table/Footer.jsx:24:22
 import { TableHead, TableRow, TableCell } from '@mui/material';
 
 const Footer = ({ prefix, cellInfos, values }) => {
-    const cellText = (index, cellInfo) =>
-        index === 0
-            ? 'Totals'
-            : cellInfo.footer
-              ? cellInfo.convert
-                  ? cellInfo.convert(values[cellInfo.id])
-                  : values[cellInfo.id]
-              : '';
+    const cellText = () => undefined;
 
     return (
killedBy: UsageByUser renders table footer
statusReason: TestingLibraryElementError: Unable to find an element with the text: Totals. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<tr
  class="MuiTableRow-root MuiTableRow-head css-1xtozoh-MuiTableRow-root"
  data-testid="user-footer"
  id="user-fo

[Killed] ConditionalExpression
src/components/table/Footer.jsx:25:9
 
 const Footer = ({ prefix, cellInfos, values }) => {
     const cellText = (index, cellInfo) =>
-        index === 0
+        false
             ? 'Totals'
             : cellInfo.footer
killedBy: UsageByUser renders table footer
statusReason: TestingLibraryElementError: Unable to find an element with the text: Totals. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<tr
  class="MuiTableRow-root MuiTableRow-head css-1xtozoh-MuiTableRow-root"
  data-testid="user-footer"
  id="user-fo

[Killed] ConditionalExpression
src/components/table/Footer.jsx:25:9
 
 const Footer = ({ prefix, cellInfos, values }) => {
     const cellText = (index, cellInfo) =>
-        index === 0
+        true
             ? 'Totals'
             : cellInfo.footer
killedBy: UsageByUser renders table footer
statusReason: TestingLibraryElementError: Found multiple elements with the text: Totals

Here are the matching elements:

Ignored nodes: comments, script, style
<th
  class="MuiTableCell-root MuiTableCell-head MuiTableCell-stickyHeader MuiTableCell-alignLeft MuiTableCell-sizeSmall css-6ujicw-MuiTableCell-root"
  scope="col"

[Killed] StringLiteral
src/components/table/Footer.jsx:26:15
 const Footer = ({ prefix, cellInfos, values }) => {
     const cellText = (index, cellInfo) =>
         index === 0
-            ? 'Totals'
+            ? ""
             : cellInfo.footer
               ? cellInfo.convert
killedBy: UsageByUser renders table footer
statusReason: TestingLibraryElementError: Unable to find an element with the text: Totals. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<tr
  class="MuiTableRow-root MuiTableRow-head css-1xtozoh-MuiTableRow-root"
  data-testid="user-footer"
  id="user-fo

[Killed] BlockStatement
src/components/table/Footer.jsx:36:53
     return (
         <TableHead>
             <TableRow key="footer" data-testid={prefix + '-footer'} id={prefix + '-footer'}>
-                {cellInfos.map((cellInfo, index) => {
-                    return (
-                        <TableCell key={cellInfo.id} align={cellInfo.align}>
-                            {cellText(index, cellInfo)}
-                        </TableCell>
-                    );
-                })}
+                {cellInfos.map((cellInfo, index) => {})}
             </TableRow>
         </TableHead>
killedBy: UsageByUser renders table footer
statusReason: TestingLibraryElementError: Unable to find an element with the text: Totals. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<tr
  class="MuiTableRow-root MuiTableRow-head css-1xtozoh-MuiTableRow-root"
  data-testid="user-footer"
  id="user-fo
