[Killed] ConditionalExpression
src/components/table/Header.jsx:27:52
 const DESCENDING = 'desc';
 
 const getDirection = (ascending) => (ascending ? ASCENDING : DESCENDING);
-const sortDirection = (orderBy, id, ascending) => (orderBy === id ? getDirection(ascending) : false);
+const sortDirection = (orderBy, id, ascending) => (true ? getDirection(ascending) : false);
 const sortDefaultDirection = (orderBy, id, ascending) => getDirection(ascending || orderBy !== id);
 const isActive = (orderBy, id) => orderBy === id;
killedBy: Header Suite sortDirection
statusReason: Error: expect(received).toBeFalsy()

Received: "asc"

[Killed] BooleanLiteral
src/components/table/Header.jsx:27:95
 const DESCENDING = 'desc';
 
 const getDirection = (ascending) => (ascending ? ASCENDING : DESCENDING);
-const sortDirection = (orderBy, id, ascending) => (orderBy === id ? getDirection(ascending) : false);
+const sortDirection = (orderBy, id, ascending) => (orderBy === id ? getDirection(ascending) : true);
 const sortDefaultDirection = (orderBy, id, ascending) => getDirection(ascending || orderBy !== id);
 const isActive = (orderBy, id) => orderBy === id;
killedBy: Header Suite sortDirection
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] EqualityOperator
src/components/table/Header.jsx:28:84
 
 const getDirection = (ascending) => (ascending ? ASCENDING : DESCENDING);
 const sortDirection = (orderBy, id, ascending) => (orderBy === id ? getDirection(ascending) : false);
-const sortDefaultDirection = (orderBy, id, ascending) => getDirection(ascending || orderBy !== id);
+const sortDefaultDirection = (orderBy, id, ascending) => getDirection(ascending || orderBy === id);
 const isActive = (orderBy, id) => orderBy === id;
 
killedBy: Header Suite SortableCell renders descending sorting cell
statusReason: Error: expect(element).toHaveClass("MuiTableSortLabel-directionDesc")

Expected the element to have class:
  MuiTableSortLabel-directionDesc
Received:
  MuiButtonBase-root MuiTableSortLabel-root Mui-active MuiTableSortLabel-directionAsc css-7x9vt0-MuiButtonBase-root-MuiTableSortLabel-root

[Killed] ConditionalExpression
src/components/table/Header.jsx:28:84
 
 const getDirection = (ascending) => (ascending ? ASCENDING : DESCENDING);
 const sortDirection = (orderBy, id, ascending) => (orderBy === id ? getDirection(ascending) : false);
-const sortDefaultDirection = (orderBy, id, ascending) => getDirection(ascending || orderBy !== id);
+const sortDefaultDirection = (orderBy, id, ascending) => getDirection(ascending || false);
 const isActive = (orderBy, id) => orderBy === id;
 
killedBy: Header Suite sortDefaultDirection
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "asc"
Received: "desc"

[Killed] ConditionalExpression
src/components/table/Header.jsx:29:35
 const getDirection = (ascending) => (ascending ? ASCENDING : DESCENDING);
 const sortDirection = (orderBy, id, ascending) => (orderBy === id ? getDirection(ascending) : false);
 const sortDefaultDirection = (orderBy, id, ascending) => getDirection(ascending || orderBy !== id);
-const isActive = (orderBy, id) => orderBy === id;
+const isActive = (orderBy, id) => true;
 
 const SortableCell = ({ prefix, cellInfo, sortHandler, ascending, orderBy }) => (
killedBy: Header Suite isActive
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] EqualityOperator
src/components/table/Header.jsx:29:35
 const getDirection = (ascending) => (ascending ? ASCENDING : DESCENDING);
 const sortDirection = (orderBy, id, ascending) => (orderBy === id ? getDirection(ascending) : false);
 const sortDefaultDirection = (orderBy, id, ascending) => getDirection(ascending || orderBy !== id);
-const isActive = (orderBy, id) => orderBy === id;
+const isActive = (orderBy, id) => orderBy !== id;
 
 const SortableCell = ({ prefix, cellInfo, sortHandler, ascending, orderBy }) => (
killedBy: Header Suite SortableCell renders ascending sorting cell
statusReason: Error: expect(element).toHaveClass("Mui-active")

Expected the element to have class:
  Mui-active
Received:
  MuiButtonBase-root MuiTableSortLabel-root MuiTableSortLabel-directionAsc css-7x9vt0-MuiButtonBase-root-MuiTableSortLabel-root

[Killed] StringLiteral
src/components/table/Header.jsx:33:31
 
 const SortableCell = ({ prefix, cellInfo, sortHandler, ascending, orderBy }) => (
     <TableCell
-        data-testid={prefix + '-' + cellInfo.id}
+        data-testid={prefix + "" + cellInfo.id}
         id={prefix + '-' + cellInfo.id}
         align={cellInfo.align}
killedBy: Header Suite Header calls onRequestSort when sortable cell is clicked
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="test-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table>
      <thead
        class="MuiTableHead-root css-1a7iywq-MuiTableHead-root"

[Survived] StringLiteral
src/components/table/Header.jsx:34:22
 const SortableCell = ({ prefix, cellInfo, sortHandler, ascending, orderBy }) => (
     <TableCell
         data-testid={prefix + '-' + cellInfo.id}
-        id={prefix + '-' + cellInfo.id}
+        id={prefix + "" + cellInfo.id}
         align={cellInfo.align}
         sortDirection={sortDirection(orderBy, cellInfo.id, ascending)}

[Killed] ArrowFunction
src/components/table/Header.jsx:73:25
 };
 
 const Header = ({ prefix, cellInfos, onRequestSort, ascending, orderBy }) => {
-    const sortHandler = (property) => (event) => {
-        onRequestSort(event, property);
-    };
+    const sortHandler = () => undefined;
 
     return (
killedBy: Header Suite Header calls onRequestSort when sortable cell is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Anything, "name"

Number of calls: 0

[Killed] BlockStatement
src/components/table/Header.jsx:73:50
 };
 
 const Header = ({ prefix, cellInfos, onRequestSort, ascending, orderBy }) => {
-    const sortHandler = (property) => (event) => {
-        onRequestSort(event, property);
-    };
+    const sortHandler = (property) => (event) => {};
 
     return (
killedBy: Header Suite Header calls onRequestSort when sortable cell is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Anything, "name"

Number of calls: 0

[Killed] StringLiteral
src/components/table/Header.jsx:79:58
 
     return (
         <TableHead>
-            <TableRow key="header" data-testid={prefix + '-header'} id={prefix + '-header'}>
+            <TableRow key="header" data-testid={prefix + ""} id={prefix + '-header'}>
                 {cellInfos.map((cellInfo) => {
                     return cellInfo.sortable ? (
killedBy: UsageByUser renders table header
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="user-header"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-1gtchvp-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] BlockStatement
src/components/table/Header.jsx:80:46
     return (
         <TableHead>
             <TableRow key="header" data-testid={prefix + '-header'} id={prefix + '-header'}>
-                {cellInfos.map((cellInfo) => {
-                    return cellInfo.sortable ? (
-                        <SortableCell
-                            key={cellInfo.id}
-                            prefix={prefix}
-                            cellInfo={cellInfo}
-                            sortHandler={sortHandler}
-                            ascending={ascending}
-                            orderBy={orderBy}
-                        ></SortableCell>
-                    ) : (
-                        <Cell key={cellInfo.id} cellInfo={cellInfo} />
-                    );
-                })}
+                {cellInfos.map((cellInfo) => {})}
             </TableRow>
         </TableHead>
killedBy: UsageByUser renders table header
statusReason: TestingLibraryElementError: Unable to find an element with the text: IP. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<tr
  class="MuiTableRow-root MuiTableRow-head css-1xtozoh-MuiTableRow-root"
  data-testid="user-header"
  id="user-header
