[Killed] ArithmeticOperator
src/components/table/Pagination.jsx:24:42
 import { Box, IconButton, TablePagination } from '@mui/material';
 import { FirstPage, KeyboardArrowLeft, KeyboardArrowRight, LastPage } from '@mui/icons-material';
 
-const lastPage = (count, rowsPerPage) => Math.ceil(count / rowsPerPage) - 1;
+const lastPage = (count, rowsPerPage) => Math.ceil(count / rowsPerPage) + 1;
 
 const isFirstPage = (page) => page === 0;
killedBy: UsageByUser handles last page change
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1
Received
       1: 0
       2: 3

Number of calls: 2

[Killed] ArithmeticOperator
src/components/table/Pagination.jsx:24:52
 import { Box, IconButton, TablePagination } from '@mui/material';
 import { FirstPage, KeyboardArrowLeft, KeyboardArrowRight, LastPage } from '@mui/icons-material';
 
-const lastPage = (count, rowsPerPage) => Math.ceil(count / rowsPerPage) - 1;
+const lastPage = (count, rowsPerPage) => Math.ceil(count * rowsPerPage) - 1;
 
 const isFirstPage = (page) => page === 0;
killedBy: UsageByUser handles last page change
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1
Received
       1: 0
       2: 539

Number of calls: 2

[Killed] ConditionalExpression
src/components/table/Pagination.jsx:26:31
 
 const lastPage = (count, rowsPerPage) => Math.ceil(count / rowsPerPage) - 1;
 
-const isFirstPage = (page) => page === 0;
+const isFirstPage = (page) => false;
 const isLastPage = (page, count, rowsPerPage) => page >= lastPage(count, rowsPerPage);
 
killedBy: Pagination Suite Pagination disables first and previous page buttons on the first page
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button aria-label="first page" class="MuiButtonBase-root MuiIconButton-root MuiIconButton-sizeMedium css-53g0n7-MuiButtonBase-root-MuiIconButton-root" tabindex="0" type="button" />

[Killed] EqualityOperator
src/components/table/Pagination.jsx:26:31
 
 const lastPage = (count, rowsPerPage) => Math.ceil(count / rowsPerPage) - 1;
 
-const isFirstPage = (page) => page === 0;
+const isFirstPage = (page) => page !== 0;
 const isLastPage = (page, count, rowsPerPage) => page >= lastPage(count, rowsPerPage);
 
killedBy: Pagination Suite Pagination disables first and previous page buttons on the first page
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button aria-label="first page" class="MuiButtonBase-root MuiIconButton-root MuiIconButton-sizeMedium css-53g0n7-MuiButtonBase-root-MuiIconButton-root" tabindex="0" type="button" />

[Killed] EqualityOperator
src/components/table/Pagination.jsx:27:50
 const lastPage = (count, rowsPerPage) => Math.ceil(count / rowsPerPage) - 1;
 
 const isFirstPage = (page) => page === 0;
-const isLastPage = (page, count, rowsPerPage) => page >= lastPage(count, rowsPerPage);
+const isLastPage = (page, count, rowsPerPage) => page < lastPage(count, rowsPerPage);
 
 const FirstPageAction = ({ page, onPageChange }) => (
killedBy: Pagination Suite Pagination calls onPageChange when next page button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Anything, 1

Number of calls: 0

[Killed] ConditionalExpression
src/components/table/Pagination.jsx:27:50
 const lastPage = (count, rowsPerPage) => Math.ceil(count / rowsPerPage) - 1;
 
 const isFirstPage = (page) => page === 0;
-const isLastPage = (page, count, rowsPerPage) => page >= lastPage(count, rowsPerPage);
+const isLastPage = (page, count, rowsPerPage) => true;
 
 const FirstPageAction = ({ page, onPageChange }) => (
killedBy: UsageByUser handles next page change
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1
Received: 0

Number of calls: 1

[Killed] ArrowFunction
src/components/table/Pagination.jsx:30:26
 const isLastPage = (page, count, rowsPerPage) => page >= lastPage(count, rowsPerPage);
 
 const FirstPageAction = ({ page, onPageChange }) => (
-    <IconButton onClick={(event) => onPageChange(event, 0)} disabled={isFirstPage(page)} aria-label="first page">
+    <IconButton onClick={() => undefined} disabled={isFirstPage(page)} aria-label="first page">
         <FirstPage />
     </IconButton>
killedBy: Pagination Suite FirstPageAction calls onPageChange when button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Anything, 0

Number of calls: 1

[Killed] ArrowFunction
src/components/table/Pagination.jsx:39:18
 
 const LastPageAction = ({ count, page, rowsPerPage, onPageChange }) => (
     <IconButton
-        onClick={(event) => onPageChange(event, Math.max(0, lastPage(count, rowsPerPage)))}
+        onClick={() => undefined}
         disabled={isLastPage(page, count, rowsPerPage)}
         aria-label="last page"
killedBy: Pagination Suite LastPageAction calls onPageChange when button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Anything, 9

Number of calls: 1

[Killed] MethodExpression
src/components/table/Pagination.jsx:39:49
 
 const LastPageAction = ({ count, page, rowsPerPage, onPageChange }) => (
     <IconButton
-        onClick={(event) => onPageChange(event, Math.max(0, lastPage(count, rowsPerPage)))}
+        onClick={(event) => onPageChange(event, Math.min(0, lastPage(count, rowsPerPage)))}
         disabled={isLastPage(page, count, rowsPerPage)}
         aria-label="last page"
killedBy: Pagination Suite LastPageAction calls onPageChange when button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Anything, 9

Number of calls: 1

[Killed] ArithmeticOperator
src/components/table/Pagination.jsx:55:57
 };
 
 const PreviousPageAction = ({ page, onPageChange }) => (
-    <IconButton onClick={(event) => onPageChange(event, page - 1)} disabled={isFirstPage(page)} aria-label="previous page">
+    <IconButton onClick={(event) => onPageChange(event, page + 1)} disabled={isFirstPage(page)} aria-label="previous page">
         <KeyboardArrowLeft />
     </IconButton>
killedBy: Pagination Suite PreviousPageAction calls onPageChange when button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Anything, 0

Number of calls: 1

[Killed] ArrowFunction
src/components/table/Pagination.jsx:55:26
 };
 
 const PreviousPageAction = ({ page, onPageChange }) => (
-    <IconButton onClick={(event) => onPageChange(event, page - 1)} disabled={isFirstPage(page)} aria-label="previous page">
+    <IconButton onClick={() => undefined} disabled={isFirstPage(page)} aria-label="previous page">
         <KeyboardArrowLeft />
     </IconButton>
killedBy: Pagination Suite PreviousPageAction calls onPageChange when button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Anything, 0

Number of calls: 1

[Killed] ArithmeticOperator
src/components/table/Pagination.jsx:64:49
 
 const NextPageAction = ({ count, page, rowsPerPage, onPageChange }) => (
     <IconButton
-        onClick={(event) => onPageChange(event, page + 1)}
+        onClick={(event) => onPageChange(event, page - 1)}
         disabled={isLastPage(page, count, rowsPerPage)}
         aria-label="next page"
killedBy: UsageByUser handles next page change
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1
Received
       1: 0
       2: -1

Number of calls: 2

[Killed] ArrowFunction
src/components/table/Pagination.jsx:64:18
 
 const NextPageAction = ({ count, page, rowsPerPage, onPageChange }) => (
     <IconButton
-        onClick={(event) => onPageChange(event, page + 1)}
+        onClick={() => undefined}
         disabled={isLastPage(page, count, rowsPerPage)}
         aria-label="next page"
killedBy: Pagination Suite Pagination calls onPageChange when next page button is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Anything, 1

Number of calls: 0

[Killed] BlockStatement
src/components/table/Pagination.jsx:97:52
     onPageChange: PropTypes.func.isRequired,
 };
 
-const rowsPerPageOptions = (rowsPerPage, count) => {
-    let rowsPerPageOptions = [rowsPerPage];
-    if (rowsPerPage !== count) {
-        for (let i = rowsPerPage * 2; i < count; i *= 2) {
-            rowsPerPageOptions.push(i);
-        }
-        rowsPerPageOptions.push(count);
-    }
-    return rowsPerPageOptions;
-};
+const rowsPerPageOptions = (rowsPerPage, count) => {};
 
 const Pagination = (props) => {
killedBy: Pagination Suite Pagination displays correct rows per page options
statusReason: TestingLibraryElementError: Unable to find an element with the text: 20. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table>
      <thead>
        <tr>

[Killed] ArrayDeclaration
src/components/table/Pagination.jsx:98:30
 };
 
 const rowsPerPageOptions = (rowsPerPage, count) => {
-    let rowsPerPageOptions = [rowsPerPage];
+    let rowsPerPageOptions = [];
     if (rowsPerPage !== count) {
         for (let i = rowsPerPage * 2; i < count; i *= 2) {
killedBy: Pagination Suite Pagination displays correct rows per page options
statusReason: TestingLibraryElementError: Unable to find an element with the text: 10. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table>
      <thead>
        <tr>

[Killed] ConditionalExpression
src/components/table/Pagination.jsx:99:9
 
 const rowsPerPageOptions = (rowsPerPage, count) => {
     let rowsPerPageOptions = [rowsPerPage];
-    if (rowsPerPage !== count) {
+    if (false) {
         for (let i = rowsPerPage * 2; i < count; i *= 2) {
             rowsPerPageOptions.push(i);
killedBy: UsageByUser handles rows per page change
statusReason: TestingLibraryElementError: Unable to find a label with the text of: rows per page

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-1gtchvp-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] EqualityOperator
src/components/table/Pagination.jsx:99:9
 
 const rowsPerPageOptions = (rowsPerPage, count) => {
     let rowsPerPageOptions = [rowsPerPage];
-    if (rowsPerPage !== count) {
+    if (rowsPerPage === count) {
         for (let i = rowsPerPage * 2; i < count; i *= 2) {
             rowsPerPageOptions.push(i);
killedBy: UsageByUser handles rows per page change
statusReason: TestingLibraryElementError: Unable to find a label with the text of: rows per page

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-1gtchvp-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] ArithmeticOperator
src/components/table/Pagination.jsx:100:22
 const rowsPerPageOptions = (rowsPerPage, count) => {
     let rowsPerPageOptions = [rowsPerPage];
     if (rowsPerPage !== count) {
-        for (let i = rowsPerPage * 2; i < count; i *= 2) {
+        for (let i = rowsPerPage / 2; i < count; i *= 2) {
             rowsPerPageOptions.push(i);
         }
killedBy: Pagination Suite Pagination displays correct rows per page options
statusReason: TestingLibraryElementError: Found multiple elements with the text: 10

Here are the matching elements:

Ignored nodes: comments, script, style
<option
  class="MuiTablePagination-menuItem"
  value="10"

[Killed] ConditionalExpression
src/components/table/Pagination.jsx:100:39
 const rowsPerPageOptions = (rowsPerPage, count) => {
     let rowsPerPageOptions = [rowsPerPage];
     if (rowsPerPage !== count) {
-        for (let i = rowsPerPage * 2; i < count; i *= 2) {
+        for (let i = rowsPerPage * 2; false; i *= 2) {
             rowsPerPageOptions.push(i);
         }
killedBy: Pagination Suite Pagination displays correct rows per page options
statusReason: TestingLibraryElementError: Unable to find an element with the text: 20. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table>
      <thead>
        <tr>

[Killed] BlockStatement
src/components/table/Pagination.jsx:108:31
     return rowsPerPageOptions;
 };
 
-const Pagination = (props) => {
-    const options = rowsPerPageOptions(Math.min(props.minimum, props.count), props.count);
-    const selectProps = {
-        inputProps: { 'aria-label': 'rows per page' },
-        native: true,
-        id: 'select-rows-per-page-id',
-        labelId: 'select-label-rows-per-page-id',
-    };
-
-    return (
-        <TablePagination
-            {...props}
-            labelRowsPerPage=""
-            slotProps={{ select: selectProps }}
-            rowsPerPageOptions={options}
-            ActionsComponent={Actions}
-        />
-    );
-};
+const Pagination = (props) => {};
 
 Pagination.propTypes = { count: PropTypes.number.isRequired, minimum: PropTypes.number.isRequired };
killedBy: Pagination Suite Pagination renders pagination actions with ids
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] MethodExpression
src/components/table/Pagination.jsx:109:40
 };
 
 const Pagination = (props) => {
-    const options = rowsPerPageOptions(Math.min(props.minimum, props.count), props.count);
+    const options = rowsPerPageOptions(Math.max(props.minimum, props.count), props.count);
     const selectProps = {
         inputProps: { 'aria-label': 'rows per page' },
killedBy: UsageByUser handles rows per page change
statusReason: TestingLibraryElementError: Unable to find a label with the text of: rows per page

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-1gtchvp-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] ObjectLiteral
src/components/table/Pagination.jsx:111:21
 const Pagination = (props) => {
     const options = rowsPerPageOptions(Math.min(props.minimum, props.count), props.count);
     const selectProps = {
-        inputProps: { 'aria-label': 'rows per page' },
+        inputProps: {},
         native: true,
         id: 'select-rows-per-page-id',
killedBy: Pagination Suite Pagination renders pagination actions
statusReason: TestingLibraryElementError: Unable to find a label with the text of: rows per page

Ignored nodes: comments, script, style
<body>
  <div>
    <table>
      <thead>
        <tr>

[Timeout] BooleanLiteral
src/components/table/Pagination.jsx:112:17
     const options = rowsPerPageOptions(Math.min(props.minimum, props.count), props.count);
     const selectProps = {
         inputProps: { 'aria-label': 'rows per page' },
-        native: true,
+        native: false,
         id: 'select-rows-per-page-id',
         labelId: 'select-label-rows-per-page-id',

[Killed] StringLiteral
src/components/table/Pagination.jsx:113:13
     const selectProps = {
         inputProps: { 'aria-label': 'rows per page' },
         native: true,
-        id: 'select-rows-per-page-id',
+        id: "",
         labelId: 'select-label-rows-per-page-id',
     };
killedBy: Pagination Suite Pagination renders pagination actions with ids
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null
