[Killed] LogicalOperator
src/components/table/UsageTable.jsx:17:10
         </TableHead>
         <Header prefix={prefix} cellInfos={cellInfos} {...headerProps} />
         <Body prefix={prefix} cellInfos={cellInfos} {...bodyProps} />
-        {showFooter && <Footer prefix={prefix} cellInfos={cellInfos} {...footerProps} />}
+        {showFooter || <Footer prefix={prefix} cellInfos={cellInfos} {...footerProps} />}
     </Table>
 );
killedBy: UsageByUser renders table footer
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="user-footer"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-1gtchvp-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] ConditionalExpression
src/components/table/UsageTable.jsx:17:10
         </TableHead>
         <Header prefix={prefix} cellInfos={cellInfos} {...headerProps} />
         <Body prefix={prefix} cellInfos={cellInfos} {...bodyProps} />
-        {showFooter && <Footer prefix={prefix} cellInfos={cellInfos} {...footerProps} />}
+        {false}
     </Table>
 );
killedBy: UsageByUser renders table footer
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="user-footer"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-1gtchvp-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"
