[Killed] BooleanLiteral
src/hooks/common/UseSort.js:21:64
 
 import { useState } from 'react';
 
-const useSortAsc = (orderByDefault) => useSort(orderByDefault, true);
+const useSortAsc = (orderByDefault) => useSort(orderByDefault, false);
 
 const useSortDesc = (orderByDefault) => useSort(orderByDefault, false);
killedBy: UseSort Ascending should initialize
statusReason: Error: expect(received).toBeTruthy()

Received: false

Ignored nodes: comments, script, style
<html>
  <head />
  <body>

[Killed] BooleanLiteral
src/hooks/common/UseSort.js:23:65
 
 const useSortAsc = (orderByDefault) => useSort(orderByDefault, true);
 
-const useSortDesc = (orderByDefault) => useSort(orderByDefault, false);
+const useSortDesc = (orderByDefault) => useSort(orderByDefault, true);
 
 const useSort = (orderByDefault, ascendingDefault) => {
killedBy: UseSort Descending should initialize
statusReason: Error: expect(received).toBeFalsy()

Received: true

Ignored nodes: comments, script, style
<html>
  <head />
  <body>

[Killed] BlockStatement
src/hooks/common/UseSort.js:25:55
 
 const useSortDesc = (orderByDefault) => useSort(orderByDefault, false);
 
-const useSort = (orderByDefault, ascendingDefault) => {
-    const [ascending, setAscending] = useState(ascendingDefault);
-    const [orderBy, setOrderBy] = useState(orderByDefault);
-
-    return { ascending, setAscending, orderBy, setOrderBy };
-};
+const useSort = (orderByDefault, ascendingDefault) => {};
 
 export { useSortDesc, useSortAsc };
killedBy: UseSort Descending should initialize
statusReason: TypeError: Cannot read properties of undefined (reading 'ascending')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
