[Killed] ArrowFunction
src/pages/bymonth/UsageByMonth.jsx:46:30
     const { years, year, setYear, data, loading } = useUsageByMonth();
     const { ascending, setAscending, orderBy, setOrderBy } = useSortDesc(cellInfos[0].id);
 
-    const handleChangeYear = (event) => setYear(event.target.value);
+    const handleChangeYear = () => undefined;
 
     const handleRequestSort = (event, property) => {
killedBy: UsageByMonth handles year selector
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 2020

Number of calls: 0

[Killed] BlockStatement
src/pages/bymonth/UsageByMonth.jsx:48:52
 
     const handleChangeYear = (event) => setYear(event.target.value);
 
-    const handleRequestSort = (event, property) => {
-        setAscending(isAscending(orderBy, property, ascending));
-        setOrderBy(property);
-    };
+    const handleRequestSort = (event, property) => {};
 
     const sortedData = () => sort(data.usage, comparator(ascending, orderBy));
killedBy: UsageByMonth handles sort request by month
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ArrowFunction
src/pages/bymonth/UsageByMonth.jsx:53:24
         setOrderBy(property);
     };
 
-    const sortedData = () => sort(data.usage, comparator(ascending, orderBy));
+    const sortedData = () => undefined;
 
     const displayData = () =>
killedBy: UsageByMonth renders table header
statusReason: TypeError: Cannot read properties of undefined (reading 'map')
