[Killed] BlockStatement
src/pages/bymonth/UsageByMonthGraph.jsx:29:33
 
 const options = { flexGrow: 1, m: 2, mt: 6 };
 
-const UsageByMonthGraph = () => {
-    const { options, series, years, year, setYear, loading } = useUsageByMonthGraph();
-
-    const handleChangeYear = (event) => setYear(event.target.value);
-
-    return (
-        <Paper>
-            <Loading isLoading={loading} />
-            <Box sx={options}>
-                <Grid container>
-                    <Grid size={2}>
-                        <DropDown
-                            data-testid="month-year-graph"
-                            id="month-year-graph"
-                            onChange={handleChangeYear}
-                            items={years}
-                            value={year}
-                        />
-                    </Grid>
-                </Grid>
-            </Box>
-            <Graph options={options} series={series} />
-        </Paper>
-    );
-};
+const UsageByMonthGraph = () => {};
 
 export default UsageByMonthGraph;
killedBy: UsageByMonthGraph renders loading state
statusReason: TestingLibraryElementError: Unable to find an element with the text: Loading.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
