[Killed] ArrowFunction
src/pages/byuser/UsageByUser.jsx:53:30
     const { page, setPage, rowsPerPage, setRowsPerPage } = usePagination(rowsPerPageMin);
     const { ascending, setAscending, orderBy, setOrderBy } = useSortAsc(cellInfos[0].id);
 
-    const handlePageChange = (event, newPage) => setPage(newPage);
+    const handlePageChange = () => undefined;
 
     const handleRowsPerPageChange = (event) => {
killedBy: UsageByUser handles next page change
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 1
Received: 0

Number of calls: 1

[Killed] BlockStatement
src/pages/byuser/UsageByUser.jsx:55:48
 
     const handlePageChange = (event, newPage) => setPage(newPage);
 
-    const handleRowsPerPageChange = (event) => {
-        setRowsPerPage(Number(event.target.value));
-        setPage(0);
-    };
+    const handleRowsPerPageChange = (event) => {};
 
     const handleChangeYear = (event) => setYear(event.target.value);
killedBy: UsageByUser handles rows per page change
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 27

Number of calls: 0

[Killed] ArrowFunction
src/pages/byuser/UsageByUser.jsx:62:31
 
     const handleChangeYear = (event) => setYear(event.target.value);
 
-    const handleChangeMonth = (event) => setMonth(event.target.value);
+    const handleChangeMonth = () => undefined;
 
     const handleChangeFilter = (event) => setFilter(event.target.value);
killedBy: UsageByUser handles month selector
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "January"

Number of calls: 0

[Killed] ArrowFunction
src/pages/byuser/UsageByUser.jsx:64:32
 
     const handleChangeMonth = (event) => setMonth(event.target.value);
 
-    const handleChangeFilter = (event) => setFilter(event.target.value);
+    const handleChangeFilter = () => undefined;
 
     const handleRequestSort = (event, property) => {
killedBy: UsageByUser handles user filter change
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "John"

Number of calls: 0

[Survived] BlockStatement
src/pages/byuser/UsageByUser.jsx:71:21
         setOrderBy(property);
     };
 
-    useEffect(() => {
-        setPage(0);
-    }, [year, month, filter, setPage]);
+    useEffect(() => {}, [year, month, filter, setPage]);
 
     const sortedData = () =>

[Killed] ArrowFunction
src/pages/byuser/UsageByUser.jsx:75:24
         setPage(0);
     }, [year, month, filter, setPage]);
 
-    const sortedData = () =>
-        sort(data.usage, comparator(ascending, orderBy)).slice(page * rowsPerPage, page * rowsPerPage + rowsPerPage);
+    const sortedData = () => undefined;
 
     const columnCount = () => cellInfos.length - 4;
killedBy: UsageByUser Pagination colSpan matches columnCount
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ArithmeticOperator
src/pages/byuser/UsageByUser.jsx:76:84
     }, [year, month, filter, setPage]);
 
     const sortedData = () =>
-        sort(data.usage, comparator(ascending, orderBy)).slice(page * rowsPerPage, page * rowsPerPage + rowsPerPage);
+        sort(data.usage, comparator(ascending, orderBy)).slice(page * rowsPerPage, page / rowsPerPage + rowsPerPage);
 
     const columnCount = () => cellInfos.length - 4;
killedBy: UsageByUser returns the correct rows for the second page
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="user-data-0"]

Ignored nodes: comments, script, style
<body
  style=""
>
  <div>
    <div

[Killed] MethodExpression
src/pages/byuser/UsageByUser.jsx:76:9
     }, [year, month, filter, setPage]);
 
     const sortedData = () =>
-        sort(data.usage, comparator(ascending, orderBy)).slice(page * rowsPerPage, page * rowsPerPage + rowsPerPage);
+        sort(data.usage, comparator(ascending, orderBy));
 
     const columnCount = () => cellInfos.length - 4;
killedBy: UsageByUser does not render table body row 21
statusReason: Error: expect(element).not.toBeInTheDocument()

[Killed] ArithmeticOperator
src/pages/byuser/UsageByUser.jsx:78:31
     const sortedData = () =>
         sort(data.usage, comparator(ascending, orderBy)).slice(page * rowsPerPage, page * rowsPerPage + rowsPerPage);
 
-    const columnCount = () => cellInfos.length - 4;
+    const columnCount = () => cellInfos.length + 4;
 
     const paginationProps = {
killedBy: UsageByUser Pagination colSpan matches columnCount
statusReason: Error: expect(element).toHaveAttribute("colspan", "7") // element.getAttribute("colspan") === "7"

Expected the element to have attribute:
  colspan="7"
Received:
  colspan="15"

[Killed] ArrowFunction
src/pages/byuser/UsageByUser.jsx:78:25
     const sortedData = () =>
         sort(data.usage, comparator(ascending, orderBy)).slice(page * rowsPerPage, page * rowsPerPage + rowsPerPage);
 
-    const columnCount = () => cellInfos.length - 4;
+    const columnCount = () => undefined;
 
     const paginationProps = {
killedBy: UsageByUser Pagination colSpan matches columnCount
statusReason: Error: expect(element).toHaveAttribute("colspan", "7") // element.getAttribute("colspan") === "7"

Expected the element to have attribute:
  colspan="7"
Received:
  colspan="1000"

[Killed] ObjectLiteral
src/pages/byuser/UsageByUser.jsx:80:29
 
     const columnCount = () => cellInfos.length - 4;
 
-    const paginationProps = {
-        'data-testid': 'user-pagination-id',
-        id: 'user-pagination-id',
-        colSpan: columnCount(),
-        count: data && data.usage ? data.usage.length : 0,
-        minimum: rowsPerPageMin,
-        rowsPerPage,
-        page,
-        onPageChange: handlePageChange,
-        onRowsPerPageChange: handleRowsPerPageChange,
-    };
+    const paginationProps = {};
     const headerProps = {
         onRequestSort: handleRequestSort,
killedBy: UsageByUser Pagination colSpan matches columnCount
statusReason: TypeError: Cannot read properties of undefined (reading 'label')

[Survived] StringLiteral
src/pages/byuser/UsageByUser.jsx:82:13
 
     const paginationProps = {
         'data-testid': 'user-pagination-id',
-        id: 'user-pagination-id',
+        id: "",
         colSpan: columnCount(),
         count: data && data.usage ? data.usage.length : 0,

[Killed] LogicalOperator
src/pages/byuser/UsageByUser.jsx:84:16
         'data-testid': 'user-pagination-id',
         id: 'user-pagination-id',
         colSpan: columnCount(),
-        count: data && data.usage ? data.usage.length : 0,
+        count: data || data.usage ? data.usage.length : 0,
         minimum: rowsPerPageMin,
         rowsPerPage,
killedBy: UsageByUser renders loading state
statusReason: TypeError: Cannot read properties of null (reading 'usage')

[Killed] ConditionalExpression
src/pages/byuser/UsageByUser.jsx:84:16
         'data-testid': 'user-pagination-id',
         id: 'user-pagination-id',
         colSpan: columnCount(),
-        count: data && data.usage ? data.usage.length : 0,
+        count: true ? data.usage.length : 0,
         minimum: rowsPerPageMin,
         rowsPerPage,
killedBy: UsageByUser renders loading state
statusReason: TypeError: Cannot read properties of null (reading 'usage')

[Killed] ObjectLiteral
src/pages/byuser/UsageByUser.jsx:91:25
         onPageChange: handlePageChange,
         onRowsPerPageChange: handleRowsPerPageChange,
     };
-    const headerProps = {
-        onRequestSort: handleRequestSort,
-        ascending,
-        orderBy,
-    };
+    const headerProps = {};
     const bodyProps = { values: data && data.usage ? sortedData() : [] };
     const footerProps = { values: data && data.total ? data.total : {} };
killedBy: UsageByUser handles sort by IP
statusReason: TypeError: onRequestSort is not a function

[Killed] ConditionalExpression
src/pages/byuser/UsageByUser.jsx:96:33
         ascending,
         orderBy,
     };
-    const bodyProps = { values: data && data.usage ? sortedData() : [] };
+    const bodyProps = { values: true ? sortedData() : [] };
     const footerProps = { values: data && data.total ? data.total : {} };
     const displayData = () =>
killedBy: UsageByUser renders loading state
statusReason: TypeError: Cannot read properties of null (reading 'usage')

[Killed] ConditionalExpression
src/pages/byuser/UsageByUser.jsx:96:33
         ascending,
         orderBy,
     };
-    const bodyProps = { values: data && data.usage ? sortedData() : [] };
+    const bodyProps = { values: false ? sortedData() : [] };
     const footerProps = { values: data && data.total ? data.total : {} };
     const displayData = () =>
killedBy: UsageByUser renders table body row 1
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="user-data-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-1gtchvp-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] ConditionalExpression
src/pages/byuser/UsageByUser.jsx:97:35
         orderBy,
     };
     const bodyProps = { values: data && data.usage ? sortedData() : [] };
-    const footerProps = { values: data && data.total ? data.total : {} };
+    const footerProps = { values: false ? data.total : {} };
     const displayData = () =>
         data ? (
killedBy: UsageByUser renders table footer
statusReason: TestingLibraryElementError: Unable to find an element with the text: 10.000. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<tr
  class="MuiTableRow-root MuiTableRow-head css-1xtozoh-MuiTableRow-root"
  data-testid="user-footer"
  id="user-fo

[Killed] LogicalOperator
src/pages/byuser/UsageByUser.jsx:97:35
         orderBy,
     };
     const bodyProps = { values: data && data.usage ? sortedData() : [] };
-    const footerProps = { values: data && data.total ? data.total : {} };
+    const footerProps = { values: data || data.total ? data.total : {} };
     const displayData = () =>
         data ? (
killedBy: UsageByUser renders loading state
statusReason: TypeError: Cannot read properties of null (reading 'total')

[Killed] ArrowFunction
src/pages/byuser/UsageByUser.jsx:98:25
     };
     const bodyProps = { values: data && data.usage ? sortedData() : [] };
     const footerProps = { values: data && data.total ? data.total : {} };
-    const displayData = () =>
-        data ? (
-            <UsageTable
-                prefix="user"
-                cellInfos={cellInfos}
-                columnCount={columnCount()}
-                paginationProps={paginationProps}
-                headerProps={headerProps}
-                bodyProps={bodyProps}
-                footerProps={footerProps}
-                showFooter={true}
-            />
-        ) : null;
+    const displayData = () => undefined;
 
     return (
killedBy: UsageByUser Pagination colSpan matches columnCount
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="user-pagination-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-1gtchvp-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] BooleanLiteral
src/pages/byuser/UsageByUser.jsx:108:29
                 headerProps={headerProps}
                 bodyProps={bodyProps}
                 footerProps={footerProps}
-                showFooter={true}
+                showFooter={false}
             />
         ) : null;
killedBy: UsageByUser renders table footer
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="user-footer"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-1gtchvp-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Survived] StringLiteral
src/pages/byuser/UsageByUser.jsx:116:40
         <Paper>
             <Loading isLoading={loading} />
             <TableContainer>
-                <div style={{ display: 'flex', gap: '1rem', marginBottom: '1rem' }}>
+                <div style={{ display: "", gap: '1rem', marginBottom: '1rem' }}>
                     <DropDown data-testid="user-year" id="user-year" onChange={handleChangeYear} items={years} value={year} />
                     <DropDown data-testid="user-month" id="user-month" onChange={handleChangeMonth} items={months} value={month} />

[Survived] StringLiteral
src/pages/byuser/UsageByUser.jsx:116:75
         <Paper>
             <Loading isLoading={loading} />
             <TableContainer>
-                <div style={{ display: 'flex', gap: '1rem', marginBottom: '1rem' }}>
+                <div style={{ display: 'flex', gap: '1rem', marginBottom: "" }}>
                     <DropDown data-testid="user-year" id="user-year" onChange={handleChangeYear} items={years} value={year} />
                     <DropDown data-testid="user-month" id="user-month" onChange={handleChangeMonth} items={months} value={month} />
