[Killed] ArrowFunction
src/pages/byyear/UsageByYear.jsx:58:24
         setOrderBy(property);
     };
 
-    const sortedData = () => sort(data, comparator(ascending, orderBy)).slice(page * rowsPerPage, page * rowsPerPage + rowsPerPage);
+    const sortedData = () => undefined;
 
     const paginationProps = {
killedBy: UsageByYear renders table header
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ArithmeticOperator
src/pages/byyear/UsageByYear.jsx:58:79
         setOrderBy(property);
     };
 
-    const sortedData = () => sort(data, comparator(ascending, orderBy)).slice(page * rowsPerPage, page * rowsPerPage + rowsPerPage);
+    const sortedData = () => sort(data, comparator(ascending, orderBy)).slice(page / rowsPerPage, page * rowsPerPage + rowsPerPage);
 
     const paginationProps = {
killedBy: UsageByYear renders sorted and paginated data (sortedData, sort by total)
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  2003
Received:
  20010.1000.0100.1100.0011

[Killed] ObjectLiteral
src/pages/byyear/UsageByYear.jsx:60:29
 
     const sortedData = () => sort(data, comparator(ascending, orderBy)).slice(page * rowsPerPage, page * rowsPerPage + rowsPerPage);
 
-    const paginationProps = {
-        'data-testid': 'year-pagination-id',
-        id: 'year-pagination-id',
-        colSpan: cellInfos.length,
-        count: data ? data.length : 0,
-        minimum: rowsPerPageMin,
-        rowsPerPage,
-        page,
-        onPageChange: handlePageChange,
-        onRowsPerPageChange: handleRowsPerPageChange,
-    };
+    const paginationProps = {};
     const headerProps = {
         onRequestSort: handleRequestSort,
killedBy: UsageByYear renders table header
statusReason: TypeError: Cannot read properties of undefined (reading 'label')

[Killed] StringLiteral
src/pages/byyear/UsageByYear.jsx:61:24
     const sortedData = () => sort(data, comparator(ascending, orderBy)).slice(page * rowsPerPage, page * rowsPerPage + rowsPerPage);
 
     const paginationProps = {
-        'data-testid': 'year-pagination-id',
+        'data-testid': "",
         id: 'year-pagination-id',
         colSpan: cellInfos.length,
killedBy: UsageByYear renders pagination
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="year-pagination-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-1gtchvp-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] ArrowFunction
src/pages/byyear/UsageByYear.jsx:77:25
         orderBy,
     };
     const bodyProps = { values: data ? sortedData() : [] };
-    const displayData = () =>
-        data ? (
-            <UsageTable
-                prefix="year"
-                cellInfos={cellInfos}
-                columnCount={cellInfos.length}
-                paginationProps={paginationProps}
-                headerProps={headerProps}
-                bodyProps={bodyProps}
-                showFooter={false}
-            />
-        ) : null;
+    const displayData = () => undefined;
 
     return (
killedBy: UsageByYear renders table header
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="year-header"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="MuiPaper-root MuiPaper-elevation MuiPaper-rounded MuiPaper-elevation1 css-1gtchvp-MuiPaper-root"
      style="--Paper-shadow: 0px 2px 1px -1px rgba(0,0,0,0.2),0px 1px 1px 0px rgba(0,0,0,0.14),0px 1px 3px 0px rgba(0,0,0,0.12);"

[Killed] BooleanLiteral
src/pages/byyear/UsageByYear.jsx:86:29
                 paginationProps={paginationProps}
                 headerProps={headerProps}
                 bodyProps={bodyProps}
-                showFooter={false}
+                showFooter={true}
             />
         ) : null;
killedBy: UsageByYear renders table header
statusReason: TypeError: Cannot read properties of undefined (reading 'download')
