[Survived] ArithmeticOperator
src/services/API.js:31:27
         this.last = DateTime.local();
     }
 
-    orderById = (a, b) => b.id - a.id;
+    orderById = (a, b) => b.id + a.id;
 
     orderByIP = (a, b) => {

[Survived] BlockStatement
src/services/API.js:33:27
 
     orderById = (a, b) => b.id - a.id;
 
-    orderByIP = (a, b) => {
-        const result = a.IP - b.IP;
-        return result === 0 ? this.orderById(a, b) : result;
-    };
+    orderByIP = (a, b) => {};
 
     orderByMonth = (a, b) => {

[Survived] ArithmeticOperator
src/services/API.js:34:24
     orderById = (a, b) => b.id - a.id;
 
     orderByIP = (a, b) => {
-        const result = a.IP - b.IP;
+        const result = a.IP + b.IP;
         return result === 0 ? this.orderById(a, b) : result;
     };

[Survived] ConditionalExpression
src/services/API.js:35:16
 
     orderByIP = (a, b) => {
         const result = a.IP - b.IP;
-        return result === 0 ? this.orderById(a, b) : result;
+        return true ? this.orderById(a, b) : result;
     };
 

[Survived] ConditionalExpression
src/services/API.js:35:16
 
     orderByIP = (a, b) => {
         const result = a.IP - b.IP;
-        return result === 0 ? this.orderById(a, b) : result;
+        return false ? this.orderById(a, b) : result;
     };
 

[Survived] BlockStatement
src/services/API.js:38:30
         return result === 0 ? this.orderById(a, b) : result;
     };
 
-    orderByMonth = (a, b) => {
-        const result = b.month - a.month;
-        return result === 0 ? this.orderByIP(a, b) : result;
-    };
+    orderByMonth = (a, b) => {};
 
     orderBy = (a, b) => {

[Survived] ArithmeticOperator
src/services/API.js:39:24
     };
 
     orderByMonth = (a, b) => {
-        const result = b.month - a.month;
+        const result = b.month + a.month;
         return result === 0 ? this.orderByIP(a, b) : result;
     };

[Survived] ConditionalExpression
src/services/API.js:40:16
 
     orderByMonth = (a, b) => {
         const result = b.month - a.month;
-        return result === 0 ? this.orderByIP(a, b) : result;
+        return false ? this.orderByIP(a, b) : result;
     };
 

[Survived] ConditionalExpression
src/services/API.js:40:16
 
     orderByMonth = (a, b) => {
         const result = b.month - a.month;
-        return result === 0 ? this.orderByIP(a, b) : result;
+        return true ? this.orderByIP(a, b) : result;
     };
 

[Killed] BlockStatement
src/services/API.js:43:25
         return result === 0 ? this.orderByIP(a, b) : result;
     };
 
-    orderBy = (a, b) => {
-        const result = b.year - a.year;
-        return result === 0 ? this.orderByMonth(a, b) : result;
-    };
+    orderBy = (a, b) => {};
 
     data = async () => {
killedBy: UseUsageByUser should initialize years
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   2013,
-   2012,

[Killed] ArithmeticOperator
src/services/API.js:44:24
     };
 
     orderBy = (a, b) => {
-        const result = b.year - a.year;
+        const result = b.year + a.year;
         return result === 0 ? this.orderByMonth(a, b) : result;
     };
killedBy: UseUsageByMonth should initialize years
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   2013,
-   2012,

[Killed] ConditionalExpression
src/services/API.js:45:16
 
     orderBy = (a, b) => {
         const result = b.year - a.year;
-        return result === 0 ? this.orderByMonth(a, b) : result;
+        return true ? this.orderByMonth(a, b) : result;
     };
 
killedBy: UseUsageByMonthGraph should initialize years
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2013,
    2012,

[Killed] EqualityOperator
src/services/API.js:45:16
 
     orderBy = (a, b) => {
         const result = b.year - a.year;
-        return result === 0 ? this.orderByMonth(a, b) : result;
+        return result !== 0 ? this.orderByMonth(a, b) : result;
     };
 
killedBy: UseYearMonth should initialize years
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   2013,
-   2012,

[Timeout] BlockStatement
src/services/API.js:48:24
         return result === 0 ? this.orderByMonth(a, b) : result;
     };
 
-    data = async () => {
-        const current = DateTime.local();
-        if (!this.cached || current.diff(this.last, ['minutes']).minutes >= RELOAD_TIME) {
-            const data = await usage.request(import.meta.env.BASE_URL);
-            this.cached = data.sort(this.orderBy);
-            this.last = current;
-        }
-        return this.cached;
-    };
+    data = async () => {};
 
     sum = (entries, days, id) => {

[Killed] BlockStatement
src/services/API.js:50:90
 
     data = async () => {
         const current = DateTime.local();
-        if (!this.cached || current.diff(this.last, ['minutes']).minutes >= RELOAD_TIME) {
-            const data = await usage.request(import.meta.env.BASE_URL);
-            this.cached = data.sort(this.orderBy);
-            this.last = current;
-        }
+        if (!this.cached || current.diff(this.last, ['minutes']).minutes >= RELOAD_TIME) {}
         return this.cached;
     };
killedBy: App renders the landing page
statusReason: Error: Timed out in waitForElementToBeRemoved.

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Survived] ConditionalExpression
src/services/API.js:50:13
 
     data = async () => {
         const current = DateTime.local();
-        if (!this.cached || current.diff(this.last, ['minutes']).minutes >= RELOAD_TIME) {
+        if (true) {
             const data = await usage.request(import.meta.env.BASE_URL);
             this.cached = data.sort(this.orderBy);

[Killed] MethodExpression
src/services/API.js:52:27
         const current = DateTime.local();
         if (!this.cached || current.diff(this.last, ['minutes']).minutes >= RELOAD_TIME) {
             const data = await usage.request(import.meta.env.BASE_URL);
-            this.cached = data.sort(this.orderBy);
+            this.cached = data;
             this.last = current;
         }
killedBy: UseUsageByUser should initialize years
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   2013,
-   2012,

[Timeout] BlockStatement
src/services/API.js:58:34
         return this.cached;
     };
 
-    sum = (entries, days, id) => {
-        let download = 0,
-            upload = 0,
-            total = 0;
-
-        entries.forEach((entry) => {
-            download += entry.download;
-            upload += entry.upload;
-            total += entry.total;
-        });
-        const average = +(total / days).toFixed(3);
-        return { id, download, upload, total, average, days };
-    };
+    sum = (entries, days, id) => {};
 
     getYears = async () => {

[Timeout] BlockStatement
src/services/API.js:63:36
             upload = 0,
             total = 0;
 
-        entries.forEach((entry) => {
-            download += entry.download;
-            upload += entry.upload;
-            total += entry.total;
-        });
+        entries.forEach((entry) => {});
         const average = +(total / days).toFixed(3);
         return { id, download, upload, total, average, days };

[Killed] AssignmentOperator
src/services/API.js:64:13
             total = 0;
 
         entries.forEach((entry) => {
-            download += entry.download;
+            download -= entry.download;
             upload += entry.upload;
             total += entry.total;
killedBy: UseUsageByYear should initialize
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "average": 1752605.622,
    "days": 365,

[Killed] AssignmentOperator
src/services/API.js:65:13
 
         entries.forEach((entry) => {
             download += entry.download;
-            upload += entry.upload;
+            upload -= entry.upload;
             total += entry.total;
         });
killedBy: UseUsageByMonth should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2,7 +2,7 @@
    "average": 1752605.622,
    "days": 365,

[Killed] AssignmentOperator
src/services/API.js:66:13
         entries.forEach((entry) => {
             download += entry.download;
             upload += entry.upload;
-            total += entry.total;
+            total -= entry.total;
         });
         const average = +(total / days).toFixed(3);
killedBy: UseUsageByUser should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "average": 2910960.6,
+   "average": -2910960.6,

[Killed] UnaryOperator
src/services/API.js:68:25
             upload += entry.upload;
             total += entry.total;
         });
-        const average = +(total / days).toFixed(3);
+        const average = -(total / days).toFixed(3);
         return { id, download, upload, total, average, days };
     };
killedBy: UseUsageByUser should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "average": 2910960.6,

[Killed] ArithmeticOperator
src/services/API.js:68:27
             upload += entry.upload;
             total += entry.total;
         });
-        const average = +(total / days).toFixed(3);
+        const average = +(total * days).toFixed(3);
         return { id, download, upload, total, average, days };
     };
killedBy: UseUsageByUser should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "average": 2910960.6,

[Timeout] BlockStatement
src/services/API.js:72:28
         return { id, download, upload, total, average, days };
     };
 
-    getYears = async () => {
-        const result = await this.data();
-        return [...new Set(result.map((element) => element.year))];
-    };
+    getYears = async () => {};
 
     getMonths = async (year) => {

[Timeout] ArrowFunction
src/services/API.js:74:39
 
     getYears = async () => {
         const result = await this.data();
-        return [...new Set(result.map((element) => element.year))];
+        return [...new Set(result.map(() => undefined))];
     };
 

[Timeout] BlockStatement
src/services/API.js:77:33
         return [...new Set(result.map((element) => element.year))];
     };
 
-    getMonths = async (year) => {
-        const result = await this.data();
-        return [...new Set(result.filter((element) => element.year === year).map((element) => element.month))];
-    };
+    getMonths = async (year) => {};
 
     getUsageByYear = async (year) => {

[Timeout] ArrowFunction
src/services/API.js:79:82
 
     getMonths = async (year) => {
         const result = await this.data();
-        return [...new Set(result.filter((element) => element.year === year).map((element) => element.month))];
+        return [...new Set(result.filter((element) => element.year === year).map(() => undefined))];
     };
 

[Timeout] ConditionalExpression
src/services/API.js:79:55
 
     getMonths = async (year) => {
         const result = await this.data();
-        return [...new Set(result.filter((element) => element.year === year).map((element) => element.month))];
+        return [...new Set(result.filter((element) => false).map((element) => element.month))];
     };
 

[Killed] BlockStatement
src/services/API.js:82:38
         return [...new Set(result.filter((element) => element.year === year).map((element) => element.month))];
     };
 
-    getUsageByYear = async (year) => {
-        const result = await this.data();
-        const days = DateTime.local(year, 12, 31).daysInYear;
-        const usage = result.filter((element) => element.year === year);
-        return this.sum(usage, days, year);
-    };
+    getUsageByYear = async (year) => {};
 
     getUsageByUser = async (year, month, filter) => {
killedBy: UseUsageByMonth should initialize years
statusReason: TypeError: Cannot read properties of undefined (reading 'total')

[Killed] EqualityOperator
src/services/API.js:85:50
     getUsageByYear = async (year) => {
         const result = await this.data();
         const days = DateTime.local(year, 12, 31).daysInYear;
-        const usage = result.filter((element) => element.year === year);
+        const usage = result.filter((element) => element.year !== year);
         return this.sum(usage, days, year);
     };
killedBy: UseUsageByMonth should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "average": 1752605.622,
+   "average": 1609344.959,

[Killed] ConditionalExpression
src/services/API.js:85:50
     getUsageByYear = async (year) => {
         const result = await this.data();
         const days = DateTime.local(year, 12, 31).daysInYear;
-        const usage = result.filter((element) => element.year === year);
+        const usage = result.filter((element) => false);
         return this.sum(usage, days, year);
     };
killedBy: UseUsageByMonth should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "average": 1752605.622,
+   "average": 0,

[Killed] BlockStatement
src/services/API.js:89:53
         return this.sum(usage, days, year);
     };
 
-    getUsageByUser = async (year, month, filter) => {
-        const result = await this.data();
-        const days = DateTime.local(year, month).daysInMonth;
-        let usage = result.filter((element) => element.year === year && element.month === month);
-        if (filter) {
-            usage = usage.filter((entry) => {
-                let filterLowerCase = filter.toLowerCase();
-                return (
-                    toIPv4(entry.IP).toLowerCase().indexOf(filterLowerCase) !== -1 ||
-                    entry.MAC.toLowerCase().indexOf(filterLowerCase) !== -1 ||
-                    entry.user.toLowerCase().indexOf(filterLowerCase) !== -1
-                );
-            });
-        }
-        const total = this.sum(usage, days, month);
-        usage.forEach((value) => (value.percent = +((value.total * 100) / total.total).toFixed(1)));
-        return { usage, total };
-    };
+    getUsageByUser = async (year, month, filter) => {};
 }
 
killedBy: UseUsageByUser should initialize usage
statusReason: TypeError: Cannot read properties of undefined (reading 'total')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/services/API.js:92:48
     getUsageByUser = async (year, month, filter) => {
         const result = await this.data();
         const days = DateTime.local(year, month).daysInMonth;
-        let usage = result.filter((element) => element.year === year && element.month === month);
+        let usage = result.filter((element) => true);
         if (filter) {
             usage = usage.filter((entry) => {
killedBy: UseUsageByUser should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "average": 2910960.6,
+   "average": 40903732.067,

[Killed] EqualityOperator
src/services/API.js:92:48
     getUsageByUser = async (year, month, filter) => {
         const result = await this.data();
         const days = DateTime.local(year, month).daysInMonth;
-        let usage = result.filter((element) => element.year === year && element.month === month);
+        let usage = result.filter((element) => element.year !== year && element.month === month);
         if (filter) {
             usage = usage.filter((entry) => {
killedBy: UseUsageByUser should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "average": 2910960.6,
+   "average": 2386671.167,

[Killed] ConditionalExpression
src/services/API.js:93:13
         const result = await this.data();
         const days = DateTime.local(year, month).daysInMonth;
         let usage = result.filter((element) => element.year === year && element.month === month);
-        if (filter) {
+        if (true) {
             usage = usage.filter((entry) => {
                 let filterLowerCase = filter.toLowerCase();
killedBy: UseUsageByMonthGraph should initialize years
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ConditionalExpression
src/services/API.js:93:13
         const result = await this.data();
         const days = DateTime.local(year, month).daysInMonth;
         let usage = result.filter((element) => element.year === year && element.month === month);
-        if (filter) {
+        if (false) {
             usage = usage.filter((entry) => {
                 let filterLowerCase = filter.toLowerCase();
killedBy: UseUsageByUser changing filter should change usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "average": 3911.033,
+   "average": 2910960.6,

[Killed] MethodExpression
src/services/API.js:94:21
         const days = DateTime.local(year, month).daysInMonth;
         let usage = result.filter((element) => element.year === year && element.month === month);
         if (filter) {
-            usage = usage.filter((entry) => {
-                let filterLowerCase = filter.toLowerCase();
-                return (
-                    toIPv4(entry.IP).toLowerCase().indexOf(filterLowerCase) !== -1 ||
-                    entry.MAC.toLowerCase().indexOf(filterLowerCase) !== -1 ||
-                    entry.user.toLowerCase().indexOf(filterLowerCase) !== -1
-                );
-            });
+            usage = usage;
         }
         const total = this.sum(usage, days, month);
killedBy: UseUsageByUser changing filter should change usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "average": 3911.033,
+   "average": 2910960.6,

[Killed] BlockStatement
src/services/API.js:94:45
         const days = DateTime.local(year, month).daysInMonth;
         let usage = result.filter((element) => element.year === year && element.month === month);
         if (filter) {
-            usage = usage.filter((entry) => {
-                let filterLowerCase = filter.toLowerCase();
-                return (
-                    toIPv4(entry.IP).toLowerCase().indexOf(filterLowerCase) !== -1 ||
-                    entry.MAC.toLowerCase().indexOf(filterLowerCase) !== -1 ||
-                    entry.user.toLowerCase().indexOf(filterLowerCase) !== -1
-                );
-            });
+            usage = usage.filter((entry) => {});
         }
         const total = this.sum(usage, days, month);
killedBy: API should return usage data by user with filter using IP
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: "[]"

[Killed] MethodExpression
src/services/API.js:95:39
         let usage = result.filter((element) => element.year === year && element.month === month);
         if (filter) {
             usage = usage.filter((entry) => {
-                let filterLowerCase = filter.toLowerCase();
+                let filterLowerCase = filter.toUpperCase();
                 return (
                     toIPv4(entry.IP).toLowerCase().indexOf(filterLowerCase) !== -1 ||
killedBy: API should return usage data by user with filter using MAC
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: "[]"

[Killed] LogicalOperator
src/services/API.js:97:21
             usage = usage.filter((entry) => {
                 let filterLowerCase = filter.toLowerCase();
                 return (
-                    toIPv4(entry.IP).toLowerCase().indexOf(filterLowerCase) !== -1 ||
-                    entry.MAC.toLowerCase().indexOf(filterLowerCase) !== -1 ||
+                    toIPv4(entry.IP).toLowerCase().indexOf(filterLowerCase) !== -1 && entry.MAC.toLowerCase().indexOf(filterLowerCase) !== -1 ||
                     entry.user.toLowerCase().indexOf(filterLowerCase) !== -1
                 );
killedBy: UseUsageByUser changing filter should change usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "average": 3911.033,
+   "average": 68.767,

[Killed] ConditionalExpression
src/services/API.js:97:21
             usage = usage.filter((entry) => {
                 let filterLowerCase = filter.toLowerCase();
                 return (
-                    toIPv4(entry.IP).toLowerCase().indexOf(filterLowerCase) !== -1 ||
-                    entry.MAC.toLowerCase().indexOf(filterLowerCase) !== -1 ||
-                    entry.user.toLowerCase().indexOf(filterLowerCase) !== -1
+                    true
                 );
             });
killedBy: UseUsageByUserGraph changing filter should change usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 24

@@ -5,11 +5,35 @@
        "show": false,
      },

[Killed] ConditionalExpression
src/services/API.js:98:21
                 let filterLowerCase = filter.toLowerCase();
                 return (
                     toIPv4(entry.IP).toLowerCase().indexOf(filterLowerCase) !== -1 ||
-                    entry.MAC.toLowerCase().indexOf(filterLowerCase) !== -1 ||
+                    false ||
                     entry.user.toLowerCase().indexOf(filterLowerCase) !== -1
                 );
killedBy: API should return usage data by user with filter using MAC
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: "[]"

[Killed] EqualityOperator
src/services/API.js:98:21
                 let filterLowerCase = filter.toLowerCase();
                 return (
                     toIPv4(entry.IP).toLowerCase().indexOf(filterLowerCase) !== -1 ||
-                    entry.MAC.toLowerCase().indexOf(filterLowerCase) !== -1 ||
+                    entry.MAC.toLowerCase().indexOf(filterLowerCase) === -1 ||
                     entry.user.toLowerCase().indexOf(filterLowerCase) !== -1
                 );
killedBy: UseUsageByUser changing filter should change usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "average": 3911.033,
+   "average": 2910960.6,

[Killed] ConditionalExpression
src/services/API.js:99:21
                 return (
                     toIPv4(entry.IP).toLowerCase().indexOf(filterLowerCase) !== -1 ||
                     entry.MAC.toLowerCase().indexOf(filterLowerCase) !== -1 ||
-                    entry.user.toLowerCase().indexOf(filterLowerCase) !== -1
+                    false
                 );
             });
killedBy: UseUsageByUserGraph changing filter should change usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

@@ -6,10 +6,9 @@
      },
    },

[Killed] UnaryOperator
src/services/API.js:99:75
                 return (
                     toIPv4(entry.IP).toLowerCase().indexOf(filterLowerCase) !== -1 ||
                     entry.MAC.toLowerCase().indexOf(filterLowerCase) !== -1 ||
-                    entry.user.toLowerCase().indexOf(filterLowerCase) !== -1
+                    entry.user.toLowerCase().indexOf(filterLowerCase) !== +1
                 );
             });
killedBy: UseUsageByUser changing filter should change usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
-   "average": 3911.033,
+   "average": 2910960.6,

[Killed] UnaryOperator
src/services/API.js:104:51
             });
         }
         const total = this.sum(usage, days, month);
-        usage.forEach((value) => (value.percent = +((value.total * 100) / total.total).toFixed(1)));
+        usage.forEach((value) => (value.percent = -(value.total * 100 / total.total).toFixed(1)));
         return { usage, total };
     };
killedBy: UseUsageByUser should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

- Object {
+ Data {
    "IP": 3232235786,

[Killed] ArrowFunction
src/services/API.js:104:23
             });
         }
         const total = this.sum(usage, days, month);
-        usage.forEach((value) => (value.percent = +((value.total * 100) / total.total).toFixed(1)));
+        usage.forEach(() => undefined);
         return { usage, total };
     };
killedBy: UseUsageByUser should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 1

- Object {
+ Data {
    "IP": 3232235786,

[Timeout] BlockStatement
src/services/API.js:114:33
 class Service {
     getYears = async () => await store.getYears();
 
-    getMonths = async (year) => {
-        const result = await store.getMonths(year);
-        return result.map((month) => DateTime.local(year, month).toFormat('MMMM'));
-    };
+    getMonths = async (year) => {};
 
     getUsageByUser = async (year, month, filter) =>

[Timeout] ArrowFunction
src/services/API.js:116:27
 
     getMonths = async (year) => {
         const result = await store.getMonths(year);
-        return result.map((month) => DateTime.local(year, month).toFormat('MMMM'));
+        return result.map(() => undefined);
     };
 

[Killed] StringLiteral
src/services/API.js:116:75
 
     getMonths = async (year) => {
         const result = await store.getMonths(year);
-        return result.map((month) => DateTime.local(year, month).toFormat('MMMM'));
+        return result.map((month) => DateTime.local(year, month).toFormat(""));
     };
 
killedBy: UseUsageByUser should initialize months
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "November"
Received: ""

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/services/API.js:122:39
     getUsageByUser = async (year, month, filter) =>
         await store.getUsageByUser(year, DateTime.fromFormat(year + '-' + month, 'yyyy-MMMM').month, filter);
 
-    getUsageByMonth = async (year) => {
-        const months = await store.getMonths(year);
-        const total = await store.getUsageByYear(year);
-        let usage = await Promise.all(
-            months.map(async (entry) => {
-                const result = await store.getUsageByUser(year, entry);
-                return result.total;
-            })
-        );
-        usage.forEach((value) => (value.percent = +((value.total * 100) / total.total).toFixed(1)));
-        return { usage, total };
-    };
+    getUsageByMonth = async (year) => {};
 
     getUsageByYear = async () => {
killedBy: UseUsageByMonth should initialize usage
statusReason: TypeError: Cannot read properties of undefined (reading 'total')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/services/API.js:126:41
         const months = await store.getMonths(year);
         const total = await store.getUsageByYear(year);
         let usage = await Promise.all(
-            months.map(async (entry) => {
-                const result = await store.getUsageByUser(year, entry);
-                return result.total;
-            })
+            months.map(async (entry) => {})
         );
         usage.forEach((value) => (value.percent = +((value.total * 100) / total.total).toFixed(1)));
killedBy: API should return usage data by month
statusReason: TypeError: Cannot read properties of undefined (reading 'total')

[Killed] ArithmeticOperator
src/services/API.js:131:53
                 return result.total;
             })
         );
-        usage.forEach((value) => (value.percent = +((value.total * 100) / total.total).toFixed(1)));
+        usage.forEach((value) => (value.percent = +(value.total * 100 * total.total).toFixed(1)));
         return { usage, total };
     };
killedBy: UseUsageByMonth should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "average": 2910960.6,
    "days": 30,

[Killed] ArrowFunction
src/services/API.js:131:23
                 return result.total;
             })
         );
-        usage.forEach((value) => (value.percent = +((value.total * 100) / total.total).toFixed(1)));
+        usage.forEach(() => undefined);
         return { usage, total };
     };
killedBy: UseUsageByMonth should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Object {
    "average": 2910960.6,
    "days": 30,

[Killed] BlockStatement
src/services/API.js:135:34
         return { usage, total };
     };
 
-    getUsageByYear = async () => {
-        const result = await store.getYears();
-        return await Promise.all(
-            result.map(async (entry) => {
-                const result = await store.getUsageByYear(entry);
-                return result;
-            })
-        );
-    };
+    getUsageByYear = async () => {};
 }
 
killedBy: UseUsageByYear should initialize
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
