[Killed] BlockStatement
src/services/API.js:138:41
     getUsageByYear = async () => {
         const result = await store.getYears();
         return await Promise.all(
-            result.map(async (entry) => {
-                const result = await store.getUsageByYear(entry);
-                return result;
-            })
+            result.map(async (entry) => {})
         );
     };
killedBy: UseUsageByYear should initialize
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"average": 1752605.622, "days": 365, "download": 603928097, "id": 2013, "total": 639701052, "upload": 35772955}
Received: undefined

Ignored nodes: comments, script, style
<html>
  <head />
