[Killed] MethodExpression
src/services/Usage.js:22:5
 import Data from './Data';
 
 const process = (response) =>
-    response
-        .replaceAll('\r', '')
-        .split('\n')
-        .map((line, index) => {
-            const elements = line.replaceAll('\n', '').split(',');
-            if (elements.length < 8) {
-                return null;
-            }
-            return new Data(
-                index,
-                elements[0],
-                elements[1],
-                elements[2],
-                elements[3],
-                elements[4],
-                elements[5],
-                elements[6],
-                elements[7]
-            );
-        })
-        .filter((line) => line !== null);
+    response.replaceAll('\r', '').split('\n').map((line, index) => {
+  const elements = line.replaceAll('\n', '').split(',');
+  if (elements.length < 8) {
+    return null;
+  }
+  return new Data(index, elements[0], elements[1], elements[2], elements[3], elements[4], elements[5], elements[6], elements[7]);
+});
 
 class Usage {
killedBy: Usage should return data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 3
Received: 7

[Killed] StringLiteral
src/services/Usage.js:24:16
 const process = (response) =>
     response
         .replaceAll('\r', '')
-        .split('\n')
+        .split("")
         .map((line, index) => {
             const elements = line.replaceAll('\n', '').split(',');
killedBy: Usage should return data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 3
Received: 0

[Killed] BlockStatement
src/services/Usage.js:25:31
     response
         .replaceAll('\r', '')
         .split('\n')
-        .map((line, index) => {
-            const elements = line.replaceAll('\n', '').split(',');
-            if (elements.length < 8) {
-                return null;
-            }
-            return new Data(
-                index,
-                elements[0],
-                elements[1],
-                elements[2],
-                elements[3],
-                elements[4],
-                elements[5],
-                elements[6],
-                elements[7]
-            );
-        })
+        .map((line, index) => {})
         .filter((line) => line !== null);
 
killedBy: Usage should return data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 3
Received: 7

[Killed] EqualityOperator
src/services/Usage.js:27:17
         .split('\n')
         .map((line, index) => {
             const elements = line.replaceAll('\n', '').split(',');
-            if (elements.length < 8) {
+            if (elements.length >= 8) {
                 return null;
             }
killedBy: Usage should return data
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] BlockStatement
src/services/Usage.js:27:38
         .split('\n')
         .map((line, index) => {
             const elements = line.replaceAll('\n', '').split(',');
-            if (elements.length < 8) {
-                return null;
-            }
+            if (elements.length < 8) {}
             return new Data(
                 index,
killedBy: Usage should return data
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] EqualityOperator
src/services/Usage.js:42:27
                 elements[7]
             );
         })
-        .filter((line) => line !== null);
+        .filter((line) => line === null);
 
 class Usage {
killedBy: Usage should return data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 3
Received: 4

[Killed] ConditionalExpression
src/services/Usage.js:42:27
                 elements[7]
             );
         })
-        .filter((line) => line !== null);
+        .filter((line) => true);
 
 class Usage {
killedBy: Usage should return data
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 3
Received: 7

[Killed] BlockStatement
src/services/Usage.js:45:35
         .filter((line) => line !== null);
 
 class Usage {
-    request = async (basepath) => {
-        const filename = basepath + '/usage.db';
-        const response = await fetch(filename);
-        if (!response.ok) {
-            throw new Error(response.status + ' ' + response.statusText);
-        }
-        const result = await response.text();
-        return process(result);
-    };
+    request = async (basepath) => {};
 }
 
killedBy: Usage should return data
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/services/Usage.js:48:13
     request = async (basepath) => {
         const filename = basepath + '/usage.db';
         const response = await fetch(filename);
-        if (!response.ok) {
+        if (true) {
             throw new Error(response.status + ' ' + response.statusText);
         }
killedBy: Usage should return data
statusReason: Error: 200 OK

[Killed] BooleanLiteral
src/services/Usage.js:48:13
     request = async (basepath) => {
         const filename = basepath + '/usage.db';
         const response = await fetch(filename);
-        if (!response.ok) {
+        if (response.ok) {
             throw new Error(response.status + ' ' + response.statusText);
         }
killedBy: Usage should return data
statusReason: Error: 200 OK
