[Killed] StringLiteral
src/utils/ConversionUtils.js:21:81
 
 import { DateTime } from 'luxon';
 
-export const timeToDate = (time) => DateTime.fromSeconds(Number(time)).toFormat('MMM dd, yyyy HH:mm');
+export const timeToDate = (time) => DateTime.fromSeconds(Number(time)).toFormat("");
 export const toMonth = (month) => DateTime.local(2012, month).toFormat('MMMM');
 export const usageInGBytes = (value) => (Number(value) / 1000000).toFixed(3);
killedBy: ConversionUtils timeToDate should return month as full name
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Jun 15, 2011 08:30"
Received: ""

[Killed] ArithmeticOperator
src/utils/ConversionUtils.js:23:42
 
 export const timeToDate = (time) => DateTime.fromSeconds(Number(time)).toFormat('MMM dd, yyyy HH:mm');
 export const toMonth = (month) => DateTime.local(2012, month).toFormat('MMMM');
-export const usageInGBytes = (value) => (Number(value) / 1000000).toFixed(3);
+export const usageInGBytes = (value) => (Number(value) * 1000000).toFixed(3);
 export const toPercent = (value) => Number(value).toFixed(1) + '%';
 export const toIPv4 = (value) => (value >>> 24) + '.' + ((value >> 16) & 255) + '.' + ((value >> 8) & 255) + '.' + (value & 255);
killedBy: UsageByYear renders table body row 1
statusReason: TestingLibraryElementError: Unable to find an element with the text: 0.100. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<tr
  class="MuiTableRow-root css-1xtozoh-MuiTableRow-root"
  data-testid="year-data-0"
  id="year-data-0"
  style="bac

[Killed] StringLiteral
src/utils/ConversionUtils.js:25:81
 export const toMonth = (month) => DateTime.local(2012, month).toFormat('MMMM');
 export const usageInGBytes = (value) => (Number(value) / 1000000).toFixed(3);
 export const toPercent = (value) => Number(value).toFixed(1) + '%';
-export const toIPv4 = (value) => (value >>> 24) + '.' + ((value >> 16) & 255) + '.' + ((value >> 8) & 255) + '.' + (value & 255);
+export const toIPv4 = (value) => (value >>> 24) + '.' + ((value >> 16) & 255) + "" + ((value >> 8) & 255) + '.' + (value & 255);
 export const fromIPv4 = (value) => value.split('.').reduce((value, octet) => (value << 8) + parseInt(octet, 10), 0) >>> 0;
 
killedBy: UseUsageByUserGraph should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 27
+ Received  + 27

@@ -5,35 +5,35 @@
        "show": false,
      },

[Killed] ArithmeticOperator
src/utils/ConversionUtils.js:26:78
 export const usageInGBytes = (value) => (Number(value) / 1000000).toFixed(3);
 export const toPercent = (value) => Number(value).toFixed(1) + '%';
 export const toIPv4 = (value) => (value >>> 24) + '.' + ((value >> 16) & 255) + '.' + ((value >> 8) & 255) + '.' + (value & 255);
-export const fromIPv4 = (value) => value.split('.').reduce((value, octet) => (value << 8) + parseInt(octet, 10), 0) >>> 0;
+export const fromIPv4 = (value) => value.split('.').reduce((value, octet) => (value << 8) - parseInt(octet, 10), 0) >>> 0;
 
killedBy: ConversionUtils fromIPv4 should return number coverted from IPv4
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 218038278
Received: 4076929018

[Killed] ArrowFunction
src/utils/ConversionUtils.js:26:60
 export const usageInGBytes = (value) => (Number(value) / 1000000).toFixed(3);
 export const toPercent = (value) => Number(value).toFixed(1) + '%';
 export const toIPv4 = (value) => (value >>> 24) + '.' + ((value >> 16) & 255) + '.' + ((value >> 8) & 255) + '.' + (value & 255);
-export const fromIPv4 = (value) => value.split('.').reduce((value, octet) => (value << 8) + parseInt(octet, 10), 0) >>> 0;
+export const fromIPv4 = (value) => value.split('.').reduce(() => undefined, 0) >>> 0;
 
killedBy: ConversionUtils fromIPv4 should return number coverted from IPv4
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 218038278
Received: 0
