[Killed] EqualityOperator
src/utils/SortUtils.js:19:56
  * Bandwidth Monitor
  */
 
-const isAscending = (orderBy, property, ascending) => (orderBy === property ? !ascending : false);
+const isAscending = (orderBy, property, ascending) => (orderBy !== property ? !ascending : false);
 
 const comparator = (isAscending, orderBy) => {
killedBy: SortUtils isAscending
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BooleanLiteral
src/utils/SortUtils.js:19:79
  * Bandwidth Monitor
  */
 
-const isAscending = (orderBy, property, ascending) => (orderBy === property ? !ascending : false);
+const isAscending = (orderBy, property, ascending) => (orderBy === property ? ascending : false);
 
 const comparator = (isAscending, orderBy) => {
killedBy: SortUtils isAscending
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BlockStatement
src/utils/SortUtils.js:21:46
 
 const isAscending = (orderBy, property, ascending) => (orderBy === property ? !ascending : false);
 
-const comparator = (isAscending, orderBy) => {
-    const ascending = (a, b, orderBy) => {
-        if (a[orderBy] < b[orderBy]) return -1;
-        if (a[orderBy] > b[orderBy]) return 1;
-        return 0;
-    };
-    const descending = (a, b, orderBy) => {
-        if (a[orderBy] > b[orderBy]) return -1;
-        if (a[orderBy] < b[orderBy]) return 1;
-        return 0;
-    };
-    return isAscending ? (a, b) => ascending(a, b, orderBy) : (a, b) => descending(a, b, orderBy);
-};
+const comparator = (isAscending, orderBy) => {};
 
 const sort = (values, comparator) => [...values].sort(comparator);
killedBy: SortUtils comparator ascending 1
statusReason: TypeError: fn is not a function

[Killed] BlockStatement
src/utils/SortUtils.js:22:42
 const isAscending = (orderBy, property, ascending) => (orderBy === property ? !ascending : false);
 
 const comparator = (isAscending, orderBy) => {
-    const ascending = (a, b, orderBy) => {
-        if (a[orderBy] < b[orderBy]) return -1;
-        if (a[orderBy] > b[orderBy]) return 1;
-        return 0;
-    };
+    const ascending = (a, b, orderBy) => {};
     const descending = (a, b, orderBy) => {
         if (a[orderBy] > b[orderBy]) return -1;
killedBy: SortUtils comparator ascending 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: undefined

[Killed] EqualityOperator
src/utils/SortUtils.js:23:13
 
 const comparator = (isAscending, orderBy) => {
     const ascending = (a, b, orderBy) => {
-        if (a[orderBy] < b[orderBy]) return -1;
+        if (a[orderBy] <= b[orderBy]) return -1;
         if (a[orderBy] > b[orderBy]) return 1;
         return 0;
killedBy: SortUtils comparator ascending 0
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: -1

[Killed] UnaryOperator
src/utils/SortUtils.js:23:45
 
 const comparator = (isAscending, orderBy) => {
     const ascending = (a, b, orderBy) => {
-        if (a[orderBy] < b[orderBy]) return -1;
+        if (a[orderBy] < b[orderBy]) return +1;
         if (a[orderBy] > b[orderBy]) return 1;
         return 0;
killedBy: SortUtils comparator ascending -1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: -1
Received: 1

[Killed] ConditionalExpression
src/utils/SortUtils.js:24:13
 const comparator = (isAscending, orderBy) => {
     const ascending = (a, b, orderBy) => {
         if (a[orderBy] < b[orderBy]) return -1;
-        if (a[orderBy] > b[orderBy]) return 1;
+        if (true) return 1;
         return 0;
     };
killedBy: SortUtils comparator ascending 0
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] EqualityOperator
src/utils/SortUtils.js:24:13
 const comparator = (isAscending, orderBy) => {
     const ascending = (a, b, orderBy) => {
         if (a[orderBy] < b[orderBy]) return -1;
-        if (a[orderBy] > b[orderBy]) return 1;
+        if (a[orderBy] >= b[orderBy]) return 1;
         return 0;
     };
killedBy: SortUtils comparator ascending 0
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] BlockStatement
src/utils/SortUtils.js:27:43
         if (a[orderBy] > b[orderBy]) return 1;
         return 0;
     };
-    const descending = (a, b, orderBy) => {
-        if (a[orderBy] > b[orderBy]) return -1;
-        if (a[orderBy] < b[orderBy]) return 1;
-        return 0;
-    };
+    const descending = (a, b, orderBy) => {};
     return isAscending ? (a, b) => ascending(a, b, orderBy) : (a, b) => descending(a, b, orderBy);
 };
killedBy: SortUtils comparator descending 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: undefined

[Killed] EqualityOperator
src/utils/SortUtils.js:28:13
         return 0;
     };
     const descending = (a, b, orderBy) => {
-        if (a[orderBy] > b[orderBy]) return -1;
+        if (a[orderBy] >= b[orderBy]) return -1;
         if (a[orderBy] < b[orderBy]) return 1;
         return 0;
killedBy: SortUtils comparator descending 0
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: -1

[Killed] EqualityOperator
src/utils/SortUtils.js:28:13
         return 0;
     };
     const descending = (a, b, orderBy) => {
-        if (a[orderBy] > b[orderBy]) return -1;
+        if (a[orderBy] <= b[orderBy]) return -1;
         if (a[orderBy] < b[orderBy]) return 1;
         return 0;
killedBy: SortUtils comparator descending 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: -1

[Killed] ConditionalExpression
src/utils/SortUtils.js:29:13
     };
     const descending = (a, b, orderBy) => {
         if (a[orderBy] > b[orderBy]) return -1;
-        if (a[orderBy] < b[orderBy]) return 1;
+        if (true) return 1;
         return 0;
     };
killedBy: SortUtils comparator descending 0
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] EqualityOperator
src/utils/SortUtils.js:29:13
     };
     const descending = (a, b, orderBy) => {
         if (a[orderBy] > b[orderBy]) return -1;
-        if (a[orderBy] < b[orderBy]) return 1;
+        if (a[orderBy] >= b[orderBy]) return 1;
         return 0;
     };
killedBy: SortUtils comparator descending 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] ArrowFunction
src/utils/SortUtils.js:32:26
         if (a[orderBy] < b[orderBy]) return 1;
         return 0;
     };
-    return isAscending ? (a, b) => ascending(a, b, orderBy) : (a, b) => descending(a, b, orderBy);
+    return isAscending ? () => undefined : (a, b) => descending(a, b, orderBy);
 };
 
killedBy: SortUtils comparator ascending 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: undefined

[Killed] ArrowFunction
src/utils/SortUtils.js:32:63
         if (a[orderBy] < b[orderBy]) return 1;
         return 0;
     };
-    return isAscending ? (a, b) => ascending(a, b, orderBy) : (a, b) => descending(a, b, orderBy);
+    return isAscending ? (a, b) => ascending(a, b, orderBy) : () => undefined;
 };
 
killedBy: SortUtils comparator descending 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: undefined

[Killed] MethodExpression
src/utils/SortUtils.js:35:38
     return isAscending ? (a, b) => ascending(a, b, orderBy) : (a, b) => descending(a, b, orderBy);
 };
 
-const sort = (values, comparator) => [...values].sort(comparator);
+const sort = (values, comparator) => [...values];
 
 export { comparator, isAscending, sort };
killedBy: UsageByYear renders sorted and paginated data (sortedData, descending)
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  2029
Received:
  20010.1000.0100.1100.0011
