[Killed] BlockStatement
src/components/inputs/Search.jsx:23:34
 import { TextField, InputAdornment } from '@mui/material';
 import SearchIcon from '@mui/icons-material/Search';
 
-const Search = ({ ...props }) => {
-    return (
-        <TextField
-            {...props}
-            placeholder="IP, MAC or USER"
-            slotProps={{
-                input: {
-                    startAdornment: (
-                        <InputAdornment position="start">
-                            <SearchIcon />
-                        </InputAdornment>
-                    ),
-                },
-            }}
-        />
-    );
-};
+const Search = ({ ...props }) => {};
 
 export default Search;
killedBy: Search Component renders search input with placeholder
statusReason: TestingLibraryElementError: Unable to find an element with the placeholder text of: IP, MAC or USER

Ignored nodes: comments, script, style
<body>
  <div />
</body>
