[Killed] BlockStatement
src/components/navigation/PageNotFound.jsx:22:28
 import React from 'react';
 import ErrorMessage from '../messages/ErrorMessage';
 
-const PageNotFound = () => {
-    return <ErrorMessage message="Page Not Found" />;
-};
+const PageNotFound = () => {};
 
 export default PageNotFound;
killedBy: PageNotFound renders "Page Not Found" message
statusReason: TestingLibraryElementError: Unable to find an element with the text: Page Not Found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
