[Killed] BlockStatement
src/components/navigation/UseNavigation.js:22:33
 import { useState, useEffect } from 'react';
 import { useLocation } from 'react-router';
 
-const useNavigation = (menu) => {
-    const [index, setIndex] = useState(0);
-    const location = useLocation();
-
-    useEffect(() => {
-        const current = menu.findIndex((routeInfo) => routeInfo.pathname === location.pathname);
-        setIndex(current === -1 ? 0 : current);
-    }, [location, menu]);
-
-    return { index, setIndex };
-};
+const useNavigation = (menu) => {};
 
 export default useNavigation;
killedBy: App renders the landing page
statusReason: TypeError: Cannot destructure property 'index' of '(0 , _UseNavigation.default)(...)' as it is undefined.

[Killed] BlockStatement
src/components/navigation/UseNavigation.js:26:21
     const [index, setIndex] = useState(0);
     const location = useLocation();
 
-    useEffect(() => {
-        const current = menu.findIndex((routeInfo) => routeInfo.pathname === location.pathname);
-        setIndex(current === -1 ? 0 : current);
-    }, [location, menu]);
+    useEffect(() => {}, [location, menu]);
 
     return { index, setIndex };
killedBy: UseNavigation should initialize
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] EqualityOperator
src/components/navigation/UseNavigation.js:27:55
     const location = useLocation();
 
     useEffect(() => {
-        const current = menu.findIndex((routeInfo) => routeInfo.pathname === location.pathname);
+        const current = menu.findIndex((routeInfo) => routeInfo.pathname !== location.pathname);
         setIndex(current === -1 ? 0 : current);
     }, [location, menu]);
killedBy: UseNavigation should initialize
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] ArrowFunction
src/components/navigation/UseNavigation.js:27:40
     const location = useLocation();
 
     useEffect(() => {
-        const current = menu.findIndex((routeInfo) => routeInfo.pathname === location.pathname);
+        const current = menu.findIndex(() => undefined);
         setIndex(current === -1 ? 0 : current);
     }, [location, menu]);
killedBy: Navigation changes route on navigation action click
statusReason: Error: expect(element).not.toHaveClass("Mui-selected")

Expected the element not to have class:
  Mui-selected
Received:
  MuiButtonBase-root MuiBottomNavigationAction-root Mui-selected css-1scjuq2-MuiButtonBase-root-MuiBottomNavigationAction-root

[Killed] EqualityOperator
src/components/navigation/UseNavigation.js:28:18
 
     useEffect(() => {
         const current = menu.findIndex((routeInfo) => routeInfo.pathname === location.pathname);
-        setIndex(current === -1 ? 0 : current);
+        setIndex(current !== -1 ? 0 : current);
     }, [location, menu]);
 
killedBy: Navigation renders navigation actions from menu
statusReason: Error: expect(element).toHaveClass("Mui-selected")

Expected the element to have class:
  Mui-selected
Received:
  MuiButtonBase-root MuiBottomNavigationAction-root css-1scjuq2-MuiButtonBase-root-MuiBottomNavigationAction-root

[Killed] ConditionalExpression
src/components/navigation/UseNavigation.js:28:18
 
     useEffect(() => {
         const current = menu.findIndex((routeInfo) => routeInfo.pathname === location.pathname);
-        setIndex(current === -1 ? 0 : current);
+        setIndex(true ? 0 : current);
     }, [location, menu]);
 
killedBy: Navigation changes route on navigation action click
statusReason: Error: expect(element).not.toHaveClass("Mui-selected")

Expected the element not to have class:
  Mui-selected
Received:
  MuiButtonBase-root MuiBottomNavigationAction-root Mui-selected css-1scjuq2-MuiButtonBase-root-MuiBottomNavigationAction-root

[Killed] ArrayDeclaration
src/components/navigation/UseNavigation.js:29:8
     useEffect(() => {
         const current = menu.findIndex((routeInfo) => routeInfo.pathname === location.pathname);
         setIndex(current === -1 ? 0 : current);
-    }, [location, menu]);
+    }, []);
 
     return { index, setIndex };
killedBy: UseNavigation should not change index if setIndex is called with invalid value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: -1
