[Killed] BlockStatement
src/hooks/bymonth/UseUsageByMonth.js:23:31
 import API from '../../services/API';
 import useYear from '../common/UseYear';
 
-const useUsageByMonth = () => {
-    const { years, year, setYear } = useYear();
-    const [data, setData] = useState();
-    const [loading, setLoading] = useState(true);
-
-    useEffect(() => {
-        async function fetch() {
-            const usageByMonth = await API.getUsageByMonth(year);
-            setData(usageByMonth);
-            setLoading(false);
-        }
-        if (year) {
-            fetch();
-        }
-    }, [year]);
-
-    return { years, year, setYear, data, loading };
-};
+const useUsageByMonth = () => {};
 
 export default useUsageByMonth;
killedBy: UseUsageByMonthGraph should initialize years
statusReason: TypeError: Cannot destructure property 'years' of '(0 , _UseUsageByMonth.default)(...)' as it is undefined.

[Survived] BooleanLiteral
src/hooks/bymonth/UseUsageByMonth.js:26:44
 const useUsageByMonth = () => {
     const { years, year, setYear } = useYear();
     const [data, setData] = useState();
-    const [loading, setLoading] = useState(true);
+    const [loading, setLoading] = useState(false);
 
     useEffect(() => {

[Killed] BlockStatement
src/hooks/bymonth/UseUsageByMonth.js:28:21
     const [data, setData] = useState();
     const [loading, setLoading] = useState(true);
 
-    useEffect(() => {
-        async function fetch() {
-            const usageByMonth = await API.getUsageByMonth(year);
-            setData(usageByMonth);
-            setLoading(false);
-        }
-        if (year) {
-            fetch();
-        }
-    }, [year]);
+    useEffect(() => {}, [year]);
 
     return { years, year, setYear, data, loading };
killedBy: UseUsageByMonthGraph should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

- Object {
-   "chart": Object {
-     "id": "usage-by-month",

[Killed] BlockStatement
src/hooks/bymonth/UseUsageByMonth.js:29:32
     const [loading, setLoading] = useState(true);
 
     useEffect(() => {
-        async function fetch() {
-            const usageByMonth = await API.getUsageByMonth(year);
-            setData(usageByMonth);
-            setLoading(false);
-        }
+        async function fetch() {}
         if (year) {
             fetch();
killedBy: UseUsageByMonth should initialize usage
statusReason: TypeError: Cannot read properties of undefined (reading 'total')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/hooks/bymonth/UseUsageByMonth.js:32:24
         async function fetch() {
             const usageByMonth = await API.getUsageByMonth(year);
             setData(usageByMonth);
-            setLoading(false);
+            setLoading(true);
         }
         if (year) {
killedBy: UseUsageByMonth should initialize usage
statusReason: Error: expect(received).toBeFalsy()

Received: true

Ignored nodes: comments, script, style
<html>
  <head />
  <body>

[Killed] BlockStatement
src/hooks/bymonth/UseUsageByMonth.js:34:19
             setData(usageByMonth);
             setLoading(false);
         }
-        if (year) {
-            fetch();
-        }
+        if (year) {}
     }, [year]);
 
killedBy: UseUsageByMonth should initialize usage
statusReason: TypeError: Cannot read properties of undefined (reading 'total')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/bymonth/UseUsageByMonth.js:34:13
             setData(usageByMonth);
             setLoading(false);
         }
-        if (year) {
+        if (false) {
             fetch();
         }
killedBy: UseUsageByMonthGraph should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

- Object {
-   "chart": Object {
-     "id": "usage-by-month",
