[Killed] BlockStatement
src/hooks/bymonth/UseUsageByMonthGraph.js:28:21
     const [options, setOptions] = useState({});
     const [series, setSeries] = useState([]);
 
-    useEffect(() => {
-        if (data) {
-            setOptions({
-                chart: {
-                    id: 'usage-by-month',
-                    toolbar: {
-                        show: false,
-                    },
-                },
-                xaxis: {
-                    categories: data.usage.map((element) => toMonth(element.id)).reverse(),
-                },
-            });
-
-            setSeries([
-                {
-                    name: 'Total Usage',
-                    data: data.usage.map((element) => Math.round(usageInGBytes(element.total))).reverse(),
-                },
-            ]);
-        }
-    }, [data]);
+    useEffect(() => {}, [data]);
 
     return { options, series, years, year, setYear, loading };
killedBy: UseUsageByMonthGraph should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

- Object {
-   "chart": Object {
-     "id": "usage-by-month",

[Killed] ConditionalExpression
src/hooks/bymonth/UseUsageByMonthGraph.js:29:13
     const [series, setSeries] = useState([]);
 
     useEffect(() => {
-        if (data) {
+        if (true) {
             setOptions({
                 chart: {
killedBy: UseUsageByMonthGraph should initialize years
statusReason: TypeError: Cannot read properties of undefined (reading 'usage')

[Killed] ConditionalExpression
src/hooks/bymonth/UseUsageByMonthGraph.js:29:13
     const [series, setSeries] = useState([]);
 
     useEffect(() => {
-        if (data) {
+        if (false) {
             setOptions({
                 chart: {
killedBy: UseUsageByMonthGraph should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

- Object {
-   "chart": Object {
-     "id": "usage-by-month",

[Killed] ObjectLiteral
src/hooks/bymonth/UseUsageByMonthGraph.js:31:24
     useEffect(() => {
         if (data) {
             setOptions({
-                chart: {
-                    id: 'usage-by-month',
-                    toolbar: {
-                        show: false,
-                    },
-                },
+                chart: {},
                 xaxis: {
                     categories: data.usage.map((element) => toMonth(element.id)).reverse(),
killedBy: UseUsageByMonthGraph should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

@@ -1,12 +1,7 @@
  Object {
-   "chart": Object {

[Killed] StringLiteral
src/hooks/bymonth/UseUsageByMonthGraph.js:32:25
         if (data) {
             setOptions({
                 chart: {
-                    id: 'usage-by-month',
+                    id: "",
                     toolbar: {
                         show: false,
killedBy: UseUsageByMonthGraph should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
  Object {
    "chart": Object {

[Killed] ObjectLiteral
src/hooks/bymonth/UseUsageByMonthGraph.js:33:30
             setOptions({
                 chart: {
                     id: 'usage-by-month',
-                    toolbar: {
-                        show: false,
-                    },
+                    toolbar: {},
                 },
                 xaxis: {
killedBy: UseUsageByMonthGraph should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

@@ -1,11 +1,9 @@
  Object {
    "chart": Object {

[Killed] BooleanLiteral
src/hooks/bymonth/UseUsageByMonthGraph.js:34:31
                 chart: {
                     id: 'usage-by-month',
                     toolbar: {
-                        show: false,
+                        show: true,
                     },
                 },
killedBy: UseUsageByMonthGraph should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,10 +1,10 @@
  Object {
    "chart": Object {

[Killed] ObjectLiteral
src/hooks/bymonth/UseUsageByMonthGraph.js:37:24
                         show: false,
                     },
                 },
-                xaxis: {
-                    categories: data.usage.map((element) => toMonth(element.id)).reverse(),
-                },
+                xaxis: {},
             });
 
killedBy: UseUsageByMonthGraph should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 15
+ Received  +  1

@@ -3,21 +3,7 @@
      "id": "usage-by-month",
      "toolbar": Object {

[Killed] MethodExpression
src/hooks/bymonth/UseUsageByMonthGraph.js:38:33
                     },
                 },
                 xaxis: {
-                    categories: data.usage.map((element) => toMonth(element.id)).reverse(),
+                    categories: data.usage.map(element => toMonth(element.id)),
                 },
             });
killedBy: UseUsageByMonthGraph should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  + 10

@@ -5,19 +5,19 @@
        "show": false,
      },

[Killed] ArrowFunction
src/hooks/bymonth/UseUsageByMonthGraph.js:38:48
                     },
                 },
                 xaxis: {
-                    categories: data.usage.map((element) => toMonth(element.id)).reverse(),
+                    categories: data.usage.map(() => undefined).reverse(),
                 },
             });
killedBy: UseUsageByMonthGraph should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 11
+ Received  + 11

@@ -5,19 +5,19 @@
        "show": false,
      },

[Killed] ObjectLiteral
src/hooks/bymonth/UseUsageByMonthGraph.js:43:17
             });
 
             setSeries([
-                {
-                    name: 'Total Usage',
-                    data: data.usage.map((element) => Math.round(usageInGBytes(element.total))).reverse(),
-                },
+                {},
             ]);
         }
killedBy: UseUsageByMonthGraph should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 16
+ Received  +  1

  Array [
-   Object {
-     "data": Array [

[Killed] MethodExpression
src/hooks/bymonth/UseUsageByMonthGraph.js:45:27
             setSeries([
                 {
                     name: 'Total Usage',
-                    data: data.usage.map((element) => Math.round(usageInGBytes(element.total))).reverse(),
+                    data: data.usage.map(element => Math.round(usageInGBytes(element.total))),
                 },
             ]);
killedBy: UseUsageByMonthGraph should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 8

  Array [
    Object {
      "data": Array [

[Killed] ArrowFunction
src/hooks/bymonth/UseUsageByMonthGraph.js:45:42
             setSeries([
                 {
                     name: 'Total Usage',
-                    data: data.usage.map((element) => Math.round(usageInGBytes(element.total))).reverse(),
+                    data: data.usage.map(() => undefined).reverse(),
                 },
             ]);
killedBy: UseUsageByMonthGraph should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 11
+ Received  + 11

  Array [
    Object {
      "data": Array [
