[Killed] BlockStatement
src/hooks/byuser/UseUsageByUser.js:23:30
 import API from '../../services/API';
 import useYearMonth from '../common/UseYearMonth';
 
-const useUsageByUser = () => {
-    const { years, year, setYear, months, month, setMonth } = useYearMonth();
-    const [filter, setFilter] = useState('');
-    const [data, setData] = useState();
-    const [loading, setLoading] = useState(true);
-
-    useEffect(() => {
-        async function fetch() {
-            const usageByUser = await API.getUsageByUser(year, month, filter);
-            setData(usageByUser);
-            setLoading(false);
-        }
-        if (year && month) {
-            fetch();
-        }
-    }, [year, month, filter]);
-
-    return { years, year, setYear, months, month, setMonth, filter, setFilter, data, loading };
-};
+const useUsageByUser = () => {};
 
 export default useUsageByUser;
killedBy: App renders the landing page
statusReason: TypeError: Cannot destructure property 'years' of '(0 , _UseUsageByUser.default)(...)' as it is undefined.

[Killed] BlockStatement
src/hooks/byuser/UseUsageByUser.js:29:21
     const [data, setData] = useState();
     const [loading, setLoading] = useState(true);
 
-    useEffect(() => {
-        async function fetch() {
-            const usageByUser = await API.getUsageByUser(year, month, filter);
-            setData(usageByUser);
-            setLoading(false);
-        }
-        if (year && month) {
-            fetch();
-        }
-    }, [year, month, filter]);
+    useEffect(() => {}, [year, month, filter]);
 
     return { years, year, setYear, months, month, setMonth, filter, setFilter, data, loading };
killedBy: App renders the landing page
statusReason: Error: Timed out in waitForElementToBeRemoved.

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] BlockStatement
src/hooks/byuser/UseUsageByUser.js:30:32
     const [loading, setLoading] = useState(true);
 
     useEffect(() => {
-        async function fetch() {
-            const usageByUser = await API.getUsageByUser(year, month, filter);
-            setData(usageByUser);
-            setLoading(false);
-        }
+        async function fetch() {}
         if (year && month) {
             fetch();
killedBy: App renders the landing page
statusReason: Error: Timed out in waitForElementToBeRemoved.

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] BooleanLiteral
src/hooks/byuser/UseUsageByUser.js:33:24
         async function fetch() {
             const usageByUser = await API.getUsageByUser(year, month, filter);
             setData(usageByUser);
-            setLoading(false);
+            setLoading(true);
         }
         if (year && month) {
killedBy: UseUsageByUser should initialize usage
statusReason: Error: expect(received).toBeFalsy()

Received: true

Ignored nodes: comments, script, style
<html>
  <head />
  <body>

[Killed] BlockStatement
src/hooks/byuser/UseUsageByUser.js:35:28
             setData(usageByUser);
             setLoading(false);
         }
-        if (year && month) {
-            fetch();
-        }
+        if (year && month) {}
     }, [year, month, filter]);
 
killedBy: App renders the landing page
statusReason: Error: Timed out in waitForElementToBeRemoved.

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] ConditionalExpression
src/hooks/byuser/UseUsageByUser.js:35:13
             setData(usageByUser);
             setLoading(false);
         }
-        if (year && month) {
+        if (false) {
             fetch();
         }
killedBy: App renders the landing page
statusReason: Error: Timed out in waitForElementToBeRemoved.

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"
