[Survived] ArrayDeclaration
src/hooks/byuser/UseUsageByUserGraph.js:26:42
 const useUsageByYearGraph = () => {
     const { years, year, setYear, months, month, setMonth, filter, setFilter, data, loading } = useUsageByUser();
     const [options, setOptions] = useState({});
-    const [series, setSeries] = useState([]);
+    const [series, setSeries] = useState(["Stryker was here"]);
 
     useEffect(() => {

[Killed] BlockStatement
src/hooks/byuser/UseUsageByUserGraph.js:28:21
     const [options, setOptions] = useState({});
     const [series, setSeries] = useState([]);
 
-    useEffect(() => {
-        if (data) {
-            setOptions({
-                chart: {
-                    id: 'usage-by-user',
-                    toolbar: {
-                        show: false,
-                    },
-                },
-                xaxis: {
-                    categories: data.usage.map((element) => toIPv4(element.IP)),
-                },
-            });
-
-            setSeries([
-                {
-                    name: 'Total Usage',
-                    data: data.usage.map((element) => Number(usageInGBytes(element.total)).toFixed(1)),
-                },
-            ]);
-        }
-    }, [data]);
+    useEffect(() => {}, [data]);
 
     return { options, series, years, year, setYear, months, month, setMonth, filter, setFilter, loading };
killedBy: UseUsageByUserGraph should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 39
+ Received  +  1

- Object {
-   "chart": Object {
-     "id": "usage-by-user",

[Killed] ObjectLiteral
src/hooks/byuser/UseUsageByUserGraph.js:31:24
     useEffect(() => {
         if (data) {
             setOptions({
-                chart: {
-                    id: 'usage-by-user',
-                    toolbar: {
-                        show: false,
-                    },
-                },
+                chart: {},
                 xaxis: {
                     categories: data.usage.map((element) => toIPv4(element.IP)),
killedBy: UseUsageByUserGraph should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

@@ -1,12 +1,7 @@
  Object {
-   "chart": Object {

[Killed] ArrowFunction
src/hooks/byuser/UseUsageByUserGraph.js:38:48
                     },
                 },
                 xaxis: {
-                    categories: data.usage.map((element) => toIPv4(element.IP)),
+                    categories: data.usage.map(() => undefined),
                 },
             });
killedBy: UseUsageByUserGraph should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 27
+ Received  + 27

@@ -5,35 +5,35 @@
        "show": false,
      },

[Killed] ArrowFunction
src/hooks/byuser/UseUsageByUserGraph.js:45:42
             setSeries([
                 {
                     name: 'Total Usage',
-                    data: data.usage.map((element) => Number(usageInGBytes(element.total)).toFixed(1)),
+                    data: data.usage.map(() => undefined),
                 },
             ]);
killedBy: UseUsageByUserGraph should initialize usage
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 27
+ Received  + 27

  Array [
    Object {
      "data": Array [
