[Killed] BlockStatement
src/hooks/byyear/UseUsageByYear.js:22:30
 import { useState, useEffect } from 'react';
 import API from '../../services/API';
 
-const useUsageByYear = () => {
-    const [data, setData] = useState();
-    const [loading, setLoading] = useState(true);
-
-    useEffect(() => {
-        async function fetch() {
-            const usageByYear = await API.getUsageByYear();
-            setData(usageByYear);
-            setLoading(false);
-        }
-        fetch();
-    }, []);
-
-    return { data, loading };
-};
+const useUsageByYear = () => {};
 
 export default useUsageByYear;
killedBy: UseUsageByYearGraph should initialize
statusReason: TypeError: Cannot destructure property 'data' of '(0 , _UseUsageByYear.default)(...)' as it is undefined.

[Killed] BlockStatement
src/hooks/byyear/UseUsageByYear.js:26:21
     const [data, setData] = useState();
     const [loading, setLoading] = useState(true);
 
-    useEffect(() => {
-        async function fetch() {
-            const usageByYear = await API.getUsageByYear();
-            setData(usageByYear);
-            setLoading(false);
-        }
-        fetch();
-    }, []);
+    useEffect(() => {}, []);
 
     return { data, loading };
killedBy: UseUsageByYearGraph should initialize
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 15
+ Received  +  1

- Object {
-   "chart": Object {
-     "id": "usage-by-year",

[Killed] BlockStatement
src/hooks/byyear/UseUsageByYear.js:27:32
     const [loading, setLoading] = useState(true);
 
     useEffect(() => {
-        async function fetch() {
-            const usageByYear = await API.getUsageByYear();
-            setData(usageByYear);
-            setLoading(false);
-        }
+        async function fetch() {}
         fetch();
     }, []);
killedBy: UseUsageByYear should initialize
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/hooks/byyear/UseUsageByYear.js:30:24
         async function fetch() {
             const usageByYear = await API.getUsageByYear();
             setData(usageByYear);
-            setLoading(false);
+            setLoading(true);
         }
         fetch();
killedBy: UseUsageByYearGraph should initialize
statusReason: Error: expect(received).toBeFalsy()

Received: true

Ignored nodes: comments, script, style
<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/hooks/byyear/UseUsageByYear.js:35:12
         fetch();
     }, []);
 
-    return { data, loading };
+    return {};
 };
 
killedBy: UseUsageByYear should initialize
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
