[Killed] BlockStatement
src/hooks/byyear/UseUsageByYearGraph.js:28:21
     const [options, setOptions] = useState({});
     const [series, setSeries] = useState([]);
 
-    useEffect(() => {
-        if (data) {
-            setOptions({
-                chart: {
-                    id: 'usage-by-year',
-                    toolbar: {
-                        show: false,
-                    },
-                },
-                xaxis: {
-                    categories: data.map((element) => element.id).reverse(),
-                },
-            });
-
-            setSeries([
-                {
-                    name: 'Total Usage',
-                    data: data.map((element) => Math.round(usageInGBytes(element.total))).reverse(),
-                },
-            ]);
-        }
-    }, [data]);
+    useEffect(() => {}, [data]);
 
     return { options, series, loading };
killedBy: UseUsageByYearGraph should initialize
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 15
+ Received  +  1

- Object {
-   "chart": Object {
-     "id": "usage-by-year",

[Killed] ObjectLiteral
src/hooks/byyear/UseUsageByYearGraph.js:30:24
 
     useEffect(() => {
         if (data) {
-            setOptions({
-                chart: {
-                    id: 'usage-by-year',
-                    toolbar: {
-                        show: false,
-                    },
-                },
-                xaxis: {
-                    categories: data.map((element) => element.id).reverse(),
-                },
-            });
+            setOptions({});
 
             setSeries([
killedBy: UseUsageByYearGraph should initialize
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 15
+ Received  +  1

- Object {
-   "chart": Object {
-     "id": "usage-by-year",

[Killed] MethodExpression
src/hooks/byyear/UseUsageByYearGraph.js:38:33
                     },
                 },
                 xaxis: {
-                    categories: data.map((element) => element.id).reverse(),
+                    categories: data.map(element => element.id),
                 },
             });
killedBy: UseUsageByYearGraph should initialize
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -5,11 +5,11 @@
        "show": false,
      },

[Killed] ArrowFunction
src/hooks/byyear/UseUsageByYearGraph.js:38:42
                     },
                 },
                 xaxis: {
-                    categories: data.map((element) => element.id).reverse(),
+                    categories: data.map(() => undefined).reverse(),
                 },
             });
killedBy: UseUsageByYearGraph should initialize
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

@@ -5,11 +5,11 @@
        "show": false,
      },

[Killed] ArrayDeclaration
src/hooks/byyear/UseUsageByYearGraph.js:42:23
                 },
             });
 
-            setSeries([
-                {
-                    name: 'Total Usage',
-                    data: data.map((element) => Math.round(usageInGBytes(element.total))).reverse(),
-                },
-            ]);
+            setSeries([]);
         }
     }, [data]);
killedBy: UseUsageByYearGraph should initialize
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Array [
-   Object {
-     "data": Array [

[Killed] ObjectLiteral
src/hooks/byyear/UseUsageByYearGraph.js:43:17
             });
 
             setSeries([
-                {
-                    name: 'Total Usage',
-                    data: data.map((element) => Math.round(usageInGBytes(element.total))).reverse(),
-                },
+                {},
             ]);
         }
killedBy: UseUsageByYearGraph should initialize
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

  Array [
-   Object {
-     "data": Array [

[Killed] MethodExpression
src/hooks/byyear/UseUsageByYearGraph.js:45:27
             setSeries([
                 {
                     name: 'Total Usage',
-                    data: data.map((element) => Math.round(usageInGBytes(element.total))).reverse(),
+                    data: data.map(element => Math.round(usageInGBytes(element.total))),
                 },
             ]);
killedBy: UseUsageByYearGraph should initialize
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
      "data": Array [

[Killed] ArrowFunction
src/hooks/byyear/UseUsageByYearGraph.js:45:36
             setSeries([
                 {
                     name: 'Total Usage',
-                    data: data.map((element) => Math.round(usageInGBytes(element.total))).reverse(),
+                    data: data.map(() => undefined).reverse(),
                 },
             ]);
killedBy: UseUsageByYearGraph should initialize
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Object {
      "data": Array [

[Killed] ArrayDeclaration
src/hooks/byyear/UseUsageByYearGraph.js:49:8
                 },
             ]);
         }
-    }, [data]);
+    }, []);
 
     return { options, series, loading };
killedBy: UseUsageByYearGraph should initialize
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 15
+ Received  +  1

- Object {
-   "chart": Object {
-     "id": "usage-by-year",

[Killed] ObjectLiteral
src/hooks/byyear/UseUsageByYearGraph.js:51:12
         }
     }, [data]);
 
-    return { options, series, loading };
+    return {};
 };
 
killedBy: UseUsageByYearGraph should initialize
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"chart": {"id": "usage-by-year", "toolbar": {"show": false}}, "xaxis": {"categories": [2011, 2012, 2013]}}
Received: undefined

Ignored nodes: comments, script, style
<html>
  <head />
