[Killed] BlockStatement
src/hooks/common/UseInterval.js:25:42
 export const DELAY_FIVE_MINUTES = 300000;
 export const DELAY_TEN_MINUTES = 600000;
 
-const useInterval = (callback, delay) => {
-    const savedCallback = useRef();
-
-    useEffect(() => {
-        savedCallback.current = callback;
-    }, [callback]);
-
-    useEffect(() => {
-        function tick() {
-            savedCallback.current();
-        }
-        let id = setInterval(tick, delay);
-        return () => clearInterval(id);
-    }, [delay]);
-};
+const useInterval = (callback, delay) => {};
 
 export default useInterval;
killedBy: useInterval should set an interval
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/hooks/common/UseInterval.js:28:21
 const useInterval = (callback, delay) => {
     const savedCallback = useRef();
 
-    useEffect(() => {
-        savedCallback.current = callback;
-    }, [callback]);
+    useEffect(() => {}, [callback]);
 
     useEffect(() => {
killedBy: useInterval should set an interval
statusReason: TypeError: savedCallback.current is not a function

[Killed] BlockStatement
src/hooks/common/UseInterval.js:32:21
         savedCallback.current = callback;
     }, [callback]);
 
-    useEffect(() => {
-        function tick() {
-            savedCallback.current();
-        }
-        let id = setInterval(tick, delay);
-        return () => clearInterval(id);
-    }, [delay]);
+    useEffect(() => {}, [delay]);
 };
 
killedBy: useInterval should set an interval
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/hooks/common/UseInterval.js:33:25
     }, [callback]);
 
     useEffect(() => {
-        function tick() {
-            savedCallback.current();
-        }
+        function tick() {}
         let id = setInterval(tick, delay);
         return () => clearInterval(id);
killedBy: useInterval should set an interval
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArrowFunction
src/hooks/common/UseInterval.js:37:16
             savedCallback.current();
         }
         let id = setInterval(tick, delay);
-        return () => clearInterval(id);
+        return () => undefined;
     }, [delay]);
 };
killedBy: useInterval should stop running on unmount
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments
