[Killed] BlockStatement
src/hooks/common/UsePagination.js:21:47
 
 import { useState } from 'react';
 
-const usePagination = (rowsPerPageDefault) => {
-    const [page, setPage] = useState(0);
-    const [rowsPerPage, setRowsPerPage] = useState(rowsPerPageDefault);
-
-    return { page, setPage, rowsPerPage, setRowsPerPage };
-};
+const usePagination = (rowsPerPageDefault) => {};
 
 export default usePagination;
killedBy: App renders the landing page
statusReason: TypeError: Cannot destructure property 'page' of '(0 , _UsePagination.default)(...)' as it is undefined.
