[Killed] BlockStatement
src/hooks/common/UseYear.js:22:23
 import { useState, useEffect } from 'react';
 import API from '../../services/API';
 
-const useYear = () => {
-    const [years, setYears] = useState();
-    const [year, setYear] = useState();
-
-    useEffect(() => {
-        async function fetch() {
-            const years = await API.getYears();
-            setYears(years);
-            setYear(years[0]);
-        }
-        fetch();
-    }, []);
-
-    return { years, year, setYear };
-};
+const useYear = () => {};
 
 export default useYear;
killedBy: UseUsageByUserGraph should initialize years
statusReason: TypeError: Cannot destructure property 'years' of '(0 , _UseYear.default)(...)' as it is undefined.

[Timeout] BlockStatement
src/hooks/common/UseYear.js:26:21
     const [years, setYears] = useState();
     const [year, setYear] = useState();
 
-    useEffect(() => {
-        async function fetch() {
-            const years = await API.getYears();
-            setYears(years);
-            setYear(years[0]);
-        }
-        fetch();
-    }, []);
+    useEffect(() => {}, []);
 
     return { years, year, setYear };

[Timeout] BlockStatement
src/hooks/common/UseYear.js:27:32
     const [year, setYear] = useState();
 
     useEffect(() => {
-        async function fetch() {
-            const years = await API.getYears();
-            setYears(years);
-            setYear(years[0]);
-        }
+        async function fetch() {}
         fetch();
     }, []);
