[Killed] BlockStatement
src/hooks/common/UseYearMonth.js:23:28
 import API from '../../services/API';
 import useYear from './UseYear';
 
-const useYearMonth = () => {
-    const { years, year, setYear } = useYear();
-    const [months, setMonths] = useState();
-    const [month, setMonth] = useState();
-
-    useEffect(() => {
-        async function fetch() {
-            const months = await API.getMonths(year);
-            setMonths(months);
-            setMonth(months[0]);
-        }
-        if (year) {
-            fetch();
-        }
-    }, [year]);
-
-    return { years, year, setYear, months, month, setMonth };
-};
+const useYearMonth = () => {};
 
 export default useYearMonth;
killedBy: App renders the landing page
statusReason: TypeError: Cannot destructure property 'years' of '(0 , _UseYearMonth.default)(...)' as it is undefined.

[Killed] BlockStatement
src/hooks/common/UseYearMonth.js:28:21
     const [months, setMonths] = useState();
     const [month, setMonth] = useState();
 
-    useEffect(() => {
-        async function fetch() {
-            const months = await API.getMonths(year);
-            setMonths(months);
-            setMonth(months[0]);
-        }
-        if (year) {
-            fetch();
-        }
-    }, [year]);
+    useEffect(() => {}, [year]);
 
     return { years, year, setYear, months, month, setMonth };
killedBy: App renders the landing page
statusReason: Error: Timed out in waitForElementToBeRemoved.

Ignored nodes: comments, script, style
<html>
  <head>
    <meta
      content=""
      name="emotion-insertion-point"

[Killed] BlockStatement
src/hooks/common/UseYearMonth.js:29:32
     const [month, setMonth] = useState();
 
     useEffect(() => {
-        async function fetch() {
-            const months = await API.getMonths(year);
-            setMonths(months);
-            setMonth(months[0]);
-        }
+        async function fetch() {}
         if (year) {
             fetch();
killedBy: UseYearMonth should initialize months
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ArrayDeclaration
src/hooks/common/UseYearMonth.js:37:8
         if (year) {
             fetch();
         }
-    }, [year]);
+    }, []);
 
     return { years, year, setYear, months, month, setMonth };
killedBy: UseUsageByUserGraph should initialize months
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
