[Killed] BlockStatement
src/pages/byyear/UsageByYearGraph.jsx:25:32
 import Loading from '../../components/loading/Loading';
 import Graph from '../../components/graph/Graph';
 
-const UsageByYearGraph = () => {
-    const { options, series, loading } = useUsageByYearGraph();
-
-    return (
-        <Paper>
-            <Loading isLoading={loading} />
-            <Graph options={options} series={series} />
-        </Paper>
-    );
-};
+const UsageByYearGraph = () => {};
 
 export default UsageByYearGraph;
killedBy: UsageByYearGraph renders loading state
statusReason: TestingLibraryElementError: Unable to find an element with the text: Loading.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
