[Killed] BlockStatement
src/services/Data.js:22:65
 import { fromIPv4 } from '../utils/ConversionUtils';
 
 export default class Data {
-    constructor(id, date, ip, mac, user, down, up, first, last) {
-        this.id = id;
-        this.IP = fromIPv4(ip);
-        this.MAC = mac;
-        this.user = user;
-        this.download = Math.abs(Number(down));
-        this.upload = Math.abs(Number(up));
-        this.firstSeen = Number(first);
-        this.lastSeen = Number(last);
-        this.year = +date.split('-')[0];
-        this.month = +date.split('-')[1];
-        this.total = this.download + this.upload;
-        this.days = Math.floor(Math.abs(this.lastSeen - this.firstSeen) / (60 * 60 * 24) + 1);
-        this.average = +(this.total / this.days).toFixed(3);
-    }
+    constructor(id, date, ip, mac, user, down, up, first, last) {}
 }
 
killedBy: Usage should return data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 15
+ Received  +  1

- Object {
-   "IP": 3232235790,
-   "MAC": "00:24:8D:28:F2:9A",

[Killed] UnaryOperator
src/services/Data.js:31:21
         this.upload = Math.abs(Number(up));
         this.firstSeen = Number(first);
         this.lastSeen = Number(last);
-        this.year = +date.split('-')[0];
+        this.year = -date.split('-')[0];
         this.month = +date.split('-')[1];
         this.total = this.download + this.upload;
killedBy: Usage should return data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -1,6 +1,6 @@
- Object {
+ Data {

[Killed] UnaryOperator
src/services/Data.js:32:22
         this.firstSeen = Number(first);
         this.lastSeen = Number(last);
         this.year = +date.split('-')[0];
-        this.month = +date.split('-')[1];
+        this.month = -date.split('-')[1];
         this.total = this.download + this.upload;
         this.days = Math.floor(Math.abs(this.lastSeen - this.firstSeen) / (60 * 60 * 24) + 1);
killedBy: Usage should return data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

- Object {
+ Data {
    "IP": 3232235790,

[Killed] ArithmeticOperator
src/services/Data.js:33:22
         this.lastSeen = Number(last);
         this.year = +date.split('-')[0];
         this.month = +date.split('-')[1];
-        this.total = this.download + this.upload;
+        this.total = this.download - this.upload;
         this.days = Math.floor(Math.abs(this.lastSeen - this.firstSeen) / (60 * 60 * 24) + 1);
         this.average = +(this.total / this.days).toFixed(3);
killedBy: Usage should return data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

- Object {
+ Data {
    "IP": 3232235790,

[Killed] ArithmeticOperator
src/services/Data.js:34:76
         this.year = +date.split('-')[0];
         this.month = +date.split('-')[1];
         this.total = this.download + this.upload;
-        this.days = Math.floor(Math.abs(this.lastSeen - this.firstSeen) / (60 * 60 * 24) + 1);
+        this.days = Math.floor(Math.abs(this.lastSeen - this.firstSeen) / (60 / 60 * 24) + 1);
         this.average = +(this.total / this.days).toFixed(3);
     }
killedBy: Usage should return data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

@@ -1,10 +1,10 @@
- Object {
+ Data {

[Killed] ArithmeticOperator
src/services/Data.js:34:76
         this.year = +date.split('-')[0];
         this.month = +date.split('-')[1];
         this.total = this.download + this.upload;
-        this.days = Math.floor(Math.abs(this.lastSeen - this.firstSeen) / (60 * 60 * 24) + 1);
+        this.days = Math.floor(Math.abs(this.lastSeen - this.firstSeen) / (60 * 60 / 24) + 1);
         this.average = +(this.total / this.days).toFixed(3);
     }
killedBy: Usage should return data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

@@ -1,10 +1,10 @@
- Object {
+ Data {

[Killed] UnaryOperator
src/services/Data.js:35:24
         this.month = +date.split('-')[1];
         this.total = this.download + this.upload;
         this.days = Math.floor(Math.abs(this.lastSeen - this.firstSeen) / (60 * 60 * 24) + 1);
-        this.average = +(this.total / this.days).toFixed(3);
+        this.average = -(this.total / this.days).toFixed(3);
     }
 }
killedBy: Usage should return data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -1,9 +1,9 @@
- Object {
+ Data {

[Killed] ArithmeticOperator
src/services/Data.js:35:26
         this.month = +date.split('-')[1];
         this.total = this.download + this.upload;
         this.days = Math.floor(Math.abs(this.lastSeen - this.firstSeen) / (60 * 60 * 24) + 1);
-        this.average = +(this.total / this.days).toFixed(3);
+        this.average = +(this.total * this.days).toFixed(3);
     }
 }
killedBy: Usage should return data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -1,9 +1,9 @@
- Object {
+ Data {
